#Tue Apr 14 13:11:00 PDT 2009
XJ022.S=\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\: ''{0}''\u3002
XN017.S=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\: \u4e88\u671f\u305b\u305a\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u7aef\u306b\u9054\u3057\u307e\u3057\u305f\u3002\u30d1\u30e9\u30e1\u30fc\u30bf\u306f \#{0} \u3067\u3059\u3002  \u6b8b\u308a\u306e\u30c7\u30fc\u30bf\u306b\u306f 0x0 \u304c\u57cb\u3081\u8fbc\u307e\u308c\u307e\u3057\u305f\u3002
XJ115.S=\u8981\u6c42\u3055\u308c\u305f\u4fdd\u6301\u6a5f\u80fd {0} \u3067\u7d50\u679c\u30bb\u30c3\u30c8\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
XJ04C.S=CallableStatement \u30d0\u30c3\u30c1\u306b\u306f\u3001\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XN013.S=\u7121\u52b9\u306a\u30b9\u30af\u30ed\u30fc\u30eb\u65b9\u5411\u3067\u3059\u3002
XJ079.S=\u6307\u5b9a\u3055\u308c\u305f\u9577\u3055 ''{0}'' \u304c BLOB/CLOB \u306e\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
XJ111.S=\u5916\u90e8\u8868\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ208.S=\u975e\u30a2\u30c8\u30df\u30c3\u30af\u30fb\u30d0\u30c3\u30c1\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002  \u30d0\u30c3\u30c1\u306f\u5b9f\u884c\u4f9d\u983c\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30d0\u30c3\u30c1\u306e\u500b\u5225\u30e1\u30f3\u30d0\u30fc\u306e\u3044\u305a\u308c\u304b\u3067 1 \u3064\u4ee5\u4e0a\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u7279\u5b9a\u306e\u30d0\u30c3\u30c1\u51e6\u7406\u6e08\u307f\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u304a\u3051\u308b\u4f8b\u5916\u3092\u53d6\u5f97\u3059\u308b\u306b\u306f getNextException() \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ204.S=\u8981\u6c42\u3055\u308c\u305f\u4fdd\u6301\u6a5f\u80fd {0} \u3067\u7d50\u679c\u30bb\u30c3\u30c8\u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
XJ071.S=\u8ca0\u306e\u9577\u3055\u5f15\u6570 ''{0}'' \u304c BLOB \u307e\u305f\u306f CLOB \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
XJ200.S=\u30bb\u30af\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570 {0} \u3092\u8d85\u3048\u307e\u3057\u305f\u3002
22005.S.6=\u8a8d\u8b58\u3055\u308c\u306a\u3044 Java SQL \u578b {0} \u3067\u3059\u3002
22005.S.5=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc {0} \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a JDBC \u578b\u3067\u3059\u3002
22005.S.4=\u8a8d\u8b58\u3055\u308c\u306a\u3044 JDBC \u578b\u3067\u3059\u3002 \u578b\: {0}\u3001columnCount\: {1}\u3001columnIndex\: {2}\u3002
22005.S.3=Unicode \u30b9\u30c8\u30ea\u30f3\u30b0\u3092 EBCDIC \u30b9\u30c8\u30ea\u30f3\u30b0\u306b\u5909\u63db\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
22005.S.2=\u5fc5\u8981\u306a\u6587\u5b57\u30b3\u30f3\u30d0\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
X0X0D.S=\u00e5\u0088\u0097\u00e3\u0081\u00ae\u00e9\u0085\u008d\u00e5\u0088\u0097\u00e9\u0095\u00b7 ''{0}'' \u00e3\u0081\u008c\u00e7\u0084\u00a1\u00e5\u008a\u00b9\u00e3\u0081\u00a7\u00e3\u0081\u0099\u00e3\u0080\u0082\u00e7\u0094\u009f\u00e6\u0088\u0090\u00e3\u0081\u0095\u00e3\u0082\u008c\u00e3\u0081\u009f\u00e3\u0082\u00ad\u00e3\u0083\u00bc\u00e3\u0082\u0092\u00e8\u00bf\u0094\u00e3\u0081\u0099\u00e3\u0081\u00ab\u00e3\u0081\u00af\u00e3\u0080\u0081\u00e5\u0088\u0097\u00e3\u0081\u00ae\u00e9\u0085\u008d\u00e5\u0088\u0097\u00e3\u0081\u00ae\u00e9\u0095\u00b7\u00e3\u0081\u0095\u00e3\u0081\u008c 1 \u00e3\u0081\u00a7\u00e3\u0081\u0082\u00e3\u0082\u008a\u00e3\u0080\u0081ID \u00e5\u0088\u0097\u00e3\u0081\u00ae\u00e3\u0081\u00bf\u00e3\u0081\u008c\u00e5\u0090\u00ab\u00e3\u0081\u00be\u00e3\u0082\u008c\u00e3\u0081\u00a6\u00e3\u0081\u0084\u00e3\u0082\u008b\u00e5\u00bf\u0085\u00e8\u00a6\u0081\u00e3\u0081\u008c\u00e3\u0081\u0082\u00e3\u0082\u008a\u00e3\u0081\u00be\u00e3\u0081\u0099\u00e3\u0080\u0082
22005.S.1=\u578b ''{0}'' \u306e\u5024\u3092\u578b ''{1}'' \u306b\u5909\u63db\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30a8\u30f3\u30b3\u30fc\u30c9\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
58016.C=DDM \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc 0x{0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
08006.C.6=JVM \u306b\u5bfe\u3057\u3066\u5927\u304d\u3059\u304e\u308b LOB \u30c7\u30fc\u30bf\u3092\u5b8c\u5168\u306b\u30de\u30c6\u30ea\u30a2\u30e9\u30a4\u30ba\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
08006.C.5=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u304b\u3089\u8aad\u307f\u53d6\u308a\u4e2d\u306e\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059\u3002{0} \u30d0\u30a4\u30c8\u4ee5\u4e0a\u306e\u30c7\u30fc\u30bf\u3092\u4e88\u671f\u3057\u3066\u3044\u307e\u3057\u305f\u304c\u53d7\u4fe1\u3057\u305f\u30c7\u30fc\u30bf\u306f {1} \u30d0\u30a4\u30c8\u306e\u307f\u3067\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
08006.C.4=\u636e\u3048\u7f6e\u304d\u63a5\u7d9a\u306e\u30ea\u30bb\u30c3\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u3001\u63a5\u7d9a\u304c\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002  \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u4ed8\u968f\u3059\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
08006.C.3=\u901a\u4fe1\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\: {0}\u3002
08006.C.2=SocketException\: ''{0}''
08006.C.1=\u63a5\u7d9a\u306e\u30ea\u30bb\u30c3\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u3001\u63a5\u7d9a\u304c\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002  \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u4ed8\u968f\u3059\u308b\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
0A000.S.7=\u30c7\u30fc\u30bf\u578b ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
0A000.S.5=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30e1\u30ab\u30cb\u30ba\u30e0 ''{0}'' \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
0A000.S.4=cancel() \u306f\u30b5\u30fc\u30d0\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XJ015.M=Derby \u30b7\u30b9\u30c6\u30e0\u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
0A000.S.3=resultSetHoldability \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
0A000.S.2=JDBC \u30e1\u30bd\u30c3\u30c9 {0} \u306f\u30b5\u30fc\u30d0\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30b5\u30fc\u30d0\u30fc\u3092\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ011.S=\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u540d\u306b NULL \u3092\u6e21\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
0A000.S.1=JDBC \u30e1\u30bd\u30c3\u30c9\u306f\u307e\u3060\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XJ108.S=\u30d6\u30ed\u30c3\u30af\u30fb\u30b5\u30a4\u30ba\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
08001.C.12=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055\u304c\u30bc\u30ed\u3067\u3042\u308b\u304b\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u3088\u308a\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u9577\u3092\u8d85\u3048\u3066\u3044\u308b\u305f\u3081\u3001\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
08001.C.11=\u30e6\u30fc\u30b6\u30fc ID \u306e\u9577\u3055\u304c\u30bc\u30ed\u3067\u3042\u308b\u304b\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u3088\u308a\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u9577\u3092\u8d85\u3048\u3066\u3044\u308b\u305f\u3081\u3001\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
08001.C.10=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u304c\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u3088\u308a\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u9577\u3092\u8d85\u3048\u3066\u3044\u308b\u305f\u3081\u3001\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XJ096.S=\u30ea\u30bd\u30fc\u30b9\u30fb\u30d0\u30f3\u30c9\u30eb\u3092 {1} \u306e {0} \u30d1\u30c3\u30b1\u30fc\u30b8\u304b\u3089\u691c\u51fa\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XJ104.S=\u5171\u6709\u9375\u306e\u9577\u3055\u304c\u7121\u52b9\u3067\u3059\: {0}\u3002
XN002.U=SECTKN \u304c\u623b\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XJ068.S=\u30d0\u30c3\u30c1\u51e6\u7406\u4e2d\u306b\u306f\u3001executeBatch \u3068 clearBatch \u3057\u304b\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ100.S=registerOutParameter \u30e1\u30bd\u30c3\u30c9\u306b\u3088\u308a\u6307\u5b9a\u3055\u308c\u305f\u4f4d\u53d6\u308a\u304c setter \u30e1\u30bd\u30c3\u30c9\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002 \u7cbe\u5ea6\u304c\u5931\u308f\u308c\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XJ064.S=setFetchDirection(int direction) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
0A000.C.6=DRDA \u30b3\u30de\u30f3\u30c9 {0} \u306f\u73fe\u5728\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ008.S=\u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u30fb\u30e2\u30fc\u30c9\u3067\u306f\u3001\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306e\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u307e\u305f\u306f\u30ea\u30ea\u30fc\u30b9\u3092\u884c\u3046\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002
XJ125.S=\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u30b9\u30af\u30ed\u30fc\u30eb\u53ef\u80fd\u306a ResultSet \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 (TYPE_SCROLL_SENSITIVE \u578b\u307e\u305f\u306f TYPE_SCROLL_INSENSITIVE \u578b) \u306b\u5bfe\u3057\u3066\u306e\u307f\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
XJ05C.S=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u4fdd\u6301\u6a5f\u80fd ResultSet.HOLD_CURSORS_OVER_COMMIT \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XJ121.S=\u73fe\u884c\u30ab\u30fc\u30bd\u30eb\u4f4d\u7f6e\u3067\u306e\u7121\u52b9\u306a\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002
XJ085.S=\u30b9\u30c8\u30ea\u30fc\u30e0\u306f\u65e2\u306b\u8aad\u307f\u53d6\u3089\u308c\u3001\u30d5\u30a1\u30a4\u30eb\u306e\u7d42\u308f\u308a\u306b\u9054\u3057\u3066\u304a\u308a\u3001\u518d\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
XJ004.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
XJ214.S=CLOB \u307e\u305f\u306f BLOB \u306b\u5bfe\u3059\u308b free() \u306e\u547c\u3073\u51fa\u3057\u4e2d\u306b IO \u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
22003.S.3=''{0}'' \u304b\u3089 {1} \u3078\u306e\u6570\u5024\u30c7\u30fc\u30bf\u578b\u5909\u63db\u4e2d\u306b\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
08004.C.9=\u00e3\u0082\u00b7\u00e3\u0082\u00b9\u00e3\u0083\u0086\u00e3\u0083\u00a0 [{1}] \u00e3\u0082\u0092\u00e3\u0082\u00b7\u00e3\u0083\u00a3\u00e3\u0083\u0083\u00e3\u0083\u0088\u00e3\u0083\u0080\u00e3\u0082\u00a6\u00e3\u0083\u00b3\u00e3\u0081\u0099\u00e3\u0082\u008b\u00e3\u0081\u009f\u00e3\u0082\u0081\u00e3\u0081\u00ae\u00e3\u0083\u00a6\u00e3\u0083\u00bc\u00e3\u0082\u00b6\u00e3\u0083\u00bc ''{0}'' \u00e3\u0081\u00ae\u00e8\u00a8\u00b1\u00e5\u008f\u00af\u00e3\u0081\u008c\u00e3\u0081\u0082\u00e3\u0082\u008a\u00e3\u0081\u00be\u00e3\u0081\u009b\u00e3\u0082\u0093\u00e3\u0080\u0082
XCL16.S.1=ResultSet \u304c\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u304c\u30aa\u30d5\u306b\u306a\u3063\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
22003.S.2=\u4f7f\u7528\u53ef\u80fd\u306a 10 \u9032\u6570\u306f\u300131 \u6841\u307e\u3067\u3067\u3059\u3002
08004.C.8=\u00e3\u0083\u00a6\u00e3\u0083\u00bc\u00e3\u0082\u00b6\u00e3\u0083\u00bc ''{0}'' \u00e3\u0081\u00af\u00e3\u0083\u0087\u00e3\u0083\u00bc\u00e3\u0082\u00bf\u00e3\u0083\u0099\u00e3\u0083\u00bc\u00e3\u0082\u00b9 ''{1}'' \u00e3\u0081\u00ab\u00e5\u00af\u00be\u00e3\u0081\u0099\u00e3\u0082\u008b\u00e8\u00a4\u0087\u00e8\u00a3\u00bd\u00e3\u0082\u00aa\u00e3\u0083\u009a\u00e3\u0083\u00ac\u00e3\u0083\u00bc\u00e3\u0082\u00b7\u00e3\u0083\u00a7\u00e3\u0083\u00b3\u00e3\u0082\u0092\u00e7\u0099\u00ba\u00e8\u00a1\u008c\u00e3\u0081\u00a7\u00e3\u0081\u008d\u00e3\u0081\u00be\u00e3\u0081\u009b\u00e3\u0082\u0093\u00e3\u0080\u0082\u00e3\u0081\u0093\u00e3\u0081\u00ae\u00e3\u0082\u00aa\u00e3\u0083\u009a\u00e3\u0083\u00ac\u00e3\u0083\u00bc\u00e3\u0082\u00b7\u00e3\u0083\u00a7\u00e3\u0083\u00b3\u00e3\u0082\u0092\u00e5\u00ae\u009f\u00e8\u00a1\u008c\u00e3\u0081\u00a7\u00e3\u0081\u008d\u00e3\u0082\u008b\u00e3\u0081\u00ae\u00e3\u0081\u00af\u00e3\u0080\u0081\u00e3\u0083\u0087\u00e3\u0083\u00bc\u00e3\u0082\u00bf\u00e3\u0083\u0099\u00e3\u0083\u00bc\u00e3\u0082\u00b9\u00e3\u0081\u00ae\u00e6\u0089\u0080\u00e6\u009c\u0089\u00e8\u0080\u0085\u00e3\u0081\u00a0\u00e3\u0081\u0091\u00e3\u0081\u00a7\u00e3\u0081\u0099\u00e3\u0080\u0082
22003.S.1=\u5e74 ({0}) \u304c\u6700\u5927\u306e ''{1}'' \u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
08004.C.7=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u304c\u8907\u88fd\u30b9\u30ec\u30fc\u30d6\u30e2\u30fc\u30c9\u306b\u3042\u308b\u305f\u3081\u3001\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
08004.C.6=\u30e6\u30fc\u30b6\u30fc ''{0}'' \u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{1}'' \u3092\u30cf\u30fc\u30c9\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3067\u304d\u308b\u306e\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.5=\u30e6\u30fc\u30b6\u30fc ''{0}'' \u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{1}'' \u3092\u6697\u53f7\u5316 (\u518d\u6697\u53f7\u5316) \u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3067\u304d\u308b\u306e\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.4=\u30e6\u30fc\u30b6\u30fc ''{0}'' \u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{1}'' \u3092\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3067\u304d\u307e\u305b\u3093\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3067\u304d\u308b\u306e\u306f\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6240\u6709\u8005\u3060\u3051\u3067\u3059\u3002
08004.C.3=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
08004.C.2=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 {0} \u304c\u691c\u51fa\u3055\u308c\u306a\u304b\u3063\u305f\u305f\u3081\u63a5\u7d9a\u306f\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\u3002
XJ081.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc ''{1}'' \u3068\u3057\u3066\u7121\u52b9\u306a\u5024 ''{0}'' \u304c\u30e1\u30bd\u30c3\u30c9 ''{2}'' \u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
08004.C.1=\u63a5\u7d9a\u8a8d\u8a3c\u306e\u969c\u5bb3\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002  \u7406\u7531\: {0}\u3002
XJ210.S=\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30b9\u30c8\u30a2\u30fc\u30c9\u30fb\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u306e\u30ed\u30fc\u30c9\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u540d\u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093\u3002
XJ057.S=Connection \u3092\u4f7f\u3063\u3066\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30b3\u30df\u30c3\u30c8\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30b3\u30df\u30c3\u30c8\u30fb\u30d7\u30ed\u30bb\u30b9\u306f\u3001XAResource \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
22015.S.1=\u7121\u52b9\u306a\u30c7\u30fc\u30bf\u5909\u63db\u3067\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u5909\u63db\u3092\u884c\u3046\u3068\u3001{0} \u306e\u7cbe\u5ea6\u304c\u5931\u308f\u308c\u307e\u3059\u3002
XCL08.S=\u30ab\u30fc\u30bd\u30eb ''{0}'' \u304c\u884c\u306b\u3042\u308a\u307e\u305b\u3093\u3002
XJ081.C=\u6307\u5b9a\u3055\u308c\u305f create/restore/recovery \u5c5e\u6027\u306b\u77db\u76fe\u304c\u3042\u308a\u307e\u3059\u3002
23502=\u5217 ''{0}'' \u306f NULL \u5024\u3092\u53d7\u3051\u5165\u308c\u3089\u308c\u307e\u305b\u3093\u3002
J134=maxStatements \u00e3\u0083\u0097\u00e3\u0083\u00ad\u00e3\u0083\u0091\u00e3\u0083\u0086\u00e3\u0082\u00a3\u00e3\u0083\u00bc\u00e3\u0081\u00ab\u00e5\u00af\u00be\u00e3\u0081\u0097\u00e3\u0081\u00a6\u00e8\u00b2\u00a0\u00e3\u0081\u00ae\u00e5\u0080\u00a4\u00e3\u0081\u00af\u00e8\u00a8\u00b1\u00e5\u008f\u00af\u00e3\u0081\u0095\u00e3\u0082\u008c\u00e3\u0081\u00a6\u00e3\u0081\u0084\u00e3\u0081\u00be\u00e3\u0081\u009b\u00e3\u0082\u0093\: {0}
J133=\u63a5\u7d9a\u306e\u30e6\u30fc\u30b6\u30fc\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u3059
J132=\u63a5\u7d9a\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3067\u3059
J131=PROTOCOL \u30c7\u30fc\u30bf\u30b9\u30c8\u30ea\u30fc\u30e0\u69cb\u6587\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002  \u7406\u7531\: 0x{0}\u3002 SSL \u5bfe\u5fdc\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u30d7\u30ec\u30fc\u30f3\u30c6\u30ad\u30b9\u30c8\u63a5\u7d9a\u3092\u8a66\u884c\u3057\u307e\u3059\u304b\u3002
J130=\u7121\u52b9 FDOCA \u8a18\u8ff0\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f
22007.S.181=\u65e5\u6642\u5024\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u8868\u8a18\u306e\u69cb\u6587\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
XJ025.S=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306f\u8ca0\u306e\u9577\u3055\u3092\u6301\u3064\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
2D521.S.2=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u5b9f\u884c\u74b0\u5883\u3067\u306f COMMIT \u307e\u305f\u306f ROLLBACK \u306f\u7121\u52b9\u3067\u3059\u3002 
2D521.S.1=setAutoCommit(true) \u306f\u3001\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u9593\u306f\u7121\u52b9\u3067\u3059\u3002
22028=\u30b9\u30c8\u30ea\u30f3\u30b0\u304c\u6700\u5927\u9577\u3067\u3042\u308b {0} \u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
XJ021.S=\u578b\u304c\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XJ118.S=\u975e\u7167\u4f1a\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306b\u5bfe\u3057\u3066\u7167\u4f1a\u30d0\u30c3\u30c1\u304c\u8981\u6c42\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.9=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: PKGNAMCSN \u306e\u9577\u3055 {0} \u306f SQLAM {1} \u3067\u306f\u7121\u52b9\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XN016.S=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\: \u30b9\u30c8\u30ea\u30fc\u30e0\u9577\u306e\u691c\u67fb\u3067\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30d1\u30e9\u30e1\u30fc\u30bf\u306f \#{0} \u3067\u3059\u3002  \u30e1\u30c3\u30bb\u30fc\u30b8\: {1}\u3002
58009.C.8=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: SCLDTA \u306e\u9577\u3055 {0} \u306f PKGID \u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.7=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: SCLDTA \u306e\u9577\u3055 {0} \u306f RDBCOLID \u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
J129=\u65e2\u306b\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u308b\u7167\u4f1a\u306b\u5bfe\u3059\u308b\u7167\u4f1a\u30aa\u30fc\u30d7\u30f3\u30fb\u30b3\u30de\u30f3\u30c9\u304c\u767a\u884c\u3055\u308c\u307e\u3057\u305f
XJ114.S=\u7121\u52b9\u306a\u30ab\u30fc\u30bd\u30eb\u540d ''{0}'' \u3067\u3059
J128=\u30ab\u30fc\u30bd\u30eb\u304c\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u307e\u305b\u3093
J127=parseSQLDIAGGRP \u306f\u307e\u3060\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
J126=\u4f1a\u8a71\u578b\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002  \u7406\u7531\: 0x{0}\u3002
J125=\u30c7\u30fc\u30bf\u8a18\u8ff0\u5b50\u30df\u30b9\u30de\u30c3\u30c1\u30fb\u30a8\u30e9\u30fc\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
XJ04B.S=\u30d0\u30c3\u30c1\u306b\u306f\u3001\u7d50\u679c\u30bb\u30c3\u30c8\u3092\u623b\u305d\u3046\u3068\u3059\u308b\u30b3\u30de\u30f3\u30c9\u3092\u5165\u308c\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
07000=\u73fe\u884c\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u521d\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
J124=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u73fe\u5728\u65e2\u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u3044\u308b\u305f\u3081\u30ea\u30ec\u30fc\u30b7\u30e7\u30ca\u30eb\u30fb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u30fb\u30b3\u30de\u30f3\u30c9 (ACCRDB) \u3092\u767a\u884c\u3067\u304d\u307e\u305b\u3093
XN012.S={0} \u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u306f\u3001XA \u306f\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u4ee5\u964d\u306b\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u308c\u306f\u30d0\u30fc\u30b8\u30e7\u30f3 {2} \u3067\u3059\u3002
J123=\u8981\u6c42\u3055\u308c\u305f\u30b3\u30de\u30f3\u30c9\u306f\u30b5\u30fc\u30d0\u30fc\u306b\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u304b\u3001\u30b3\u30de\u30f3\u30c9\u304c\u3001\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u56fa\u6709\u306e\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u5b58\u5728\u3057\u306a\u3044\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u56fa\u6709\u306e\u72b6\u614b\u306b\u906d\u9047\u3057\u307e\u3057\u305f
08003.C.3=\u57fa\u790e\u3068\u306a\u308b\u7269\u7406\u63a5\u7d9a\u304c\u5931\u52b9\u3057\u3066\u3044\u308b\u304b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
J122=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8981\u6c42\u3059\u308b\u30b3\u30de\u30f3\u30c9 (ACCRDB) \u306e\u524d\u306b\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30b5\u30fc\u30d3\u30b9\u3092\u8981\u6c42\u3059\u308b\u30b3\u30de\u30f3\u30c9\u304c\u767a\u884c\u3055\u308c\u307e\u3057\u305f
08003.C.2=\u63a5\u7d9a\u306e\u30af\u30ed\u30fc\u30ba\u5f8c\u306b LOB \u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f
J121=\u30e6\u30fc\u30b6\u30fc\u306b\u306f\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093
08003.C.1=\u30af\u30ed\u30fc\u30ba\u3055\u308c\u305f PooledConnection \u306b\u5bfe\u3059\u308b getConnection() \u306f\u7121\u52b9\u3067\u3059\u3002
J120=\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093
XJ110.S=\u4e3b\u8868\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ078.S=\u30aa\u30d5\u30bb\u30c3\u30c8 ''{0}'' \u304c\u30bc\u30ed\u3088\u308a\u5c0f\u3055\u3044\u304b\u3001\u73fe\u884c\u306e BLOB/CLOB \u306b\u5bfe\u3057\u3066\u5927\u304d\u3059\u304e\u307e\u3059\u3002
XJ207.S=executeQuery \u30e1\u30bd\u30c3\u30c9\u3092\u66f4\u65b0\u7528\u306b\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
24501.S=\u6307\u5b9a\u3055\u308c\u305f\u30ab\u30fc\u30bd\u30eb\u304c\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
X0X95.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 ''{1}'' \u306b\u304a\u3044\u3066\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 ''{0}'' \u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u305d\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5f93\u5c5e\u3059\u308b\u30aa\u30fc\u30d7\u30f3\u3055\u308c\u3066\u3044\u308b ResultSet \u304c\u3042\u308a\u307e\u3059\u3002
22018=\u578b {0} \u306b\u5bfe\u3057\u3066\u7121\u52b9\u306a\u6587\u5b57\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3067\u3059\u3002
XJ074.S=Statement.setQueryTimeout(int seconds) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XJ203.S=\u30ab\u30fc\u30bd\u30eb\u540d ''{0}'' \u306f\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XJ070.S=\u8ca0\u307e\u305f\u306f\u30bc\u30ed\u306e\u4f4d\u7f6e\u5f15\u6570 ''{0}'' \u304c BLOB \u307e\u305f\u306f CLOB \u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
J118=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u671f\u9650\u5207\u308c\u3067\u3059
J117=ACCSEC \u306e SECTKN \u304c\u5fc5\u8981\u306a\u306e\u306b\u6b20\u843d\u3057\u3066\u3044\u308b\u304b\u3001\u7121\u52b9\u3067\u3059
J116=\u30ed\u30fc\u30ab\u30eb\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u518d\u8a66\u884c\u4e0d\u80fd\u30a8\u30e9\u30fc\u3067\u3059
J115=\u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059
J114=\u30e6\u30fc\u30b6\u30fc ID \u304c\u53d6\u308a\u6d88\u3055\u308c\u307e\u3057\u305f
J113=\u30e6\u30fc\u30b6\u30fc ID \u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059
J112=\u30e6\u30fc\u30b6\u30fc ID \u304c\u6b20\u843d\u3057\u3066\u3044\u307e\u3059
58015.C=DDM \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 0x{0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
J111=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u6b20\u843d\u3057\u3066\u3044\u307e\u3059
J110=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30e1\u30ab\u30cb\u30ba\u30e0\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
XJ042.S=''{0}'' \u306f\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc ''{1}'' \u306b\u6709\u52b9\u306a\u5024\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XJ018.S=\u5217\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
08006.D=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
08006.C=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u3001\u63a5\u7d9a\u304c\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\: {0}
22005=\u578b ''{1}'' \u306e\u30c7\u30fc\u30bf\u5024\u304b\u3089\u578b ''{0}'' \u306e\u30c7\u30fc\u30bf\u5024\u3092\u53d6\u5f97\u3057\u3088\u3046\u3068\u3057\u307e\u3057\u305f\u3002
XJ014.S=\u4e0d\u7279\u5b9a\u306e\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306b\u540d\u524d\u304c\u3042\u308a\u307e\u305b\u3093\u3002
22003=\u7d50\u679c\u5024\u306f\u3001\u30c7\u30fc\u30bf\u578b {0} \u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002
XJ099.S=Reader/Stream \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u9577\u3055\u3092\u793a\u3059\u6587\u5b57\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XN009.S=BLOB/CLOB \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u9577\u3055\u306e\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u304c\u5f8c\u306b\u7d9a\u304d\u307e\u3059\u3002
XJ010.S=autoCommit \u304c\u30aa\u30f3\u306b\u306a\u3063\u3066\u3044\u308b\u3068\u304d\u306b\u306f\u3001savepoint \u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
J109=\u4e0d\u9069\u5207\u306a TCP/IP \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u69cb\u6210\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002  \u30ed\u30fc\u30ab\u30eb\u30db\u30b9\u30c8\u306e IP \u30a2\u30c9\u30ec\u30b9\u3092\u5224\u5225\u3067\u304d\u307e\u305b\u3093\:''{0}''\u3002 \u3054\u4f7f\u7528\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30de\u30b7\u30f3\u306e IP \u30a2\u30c9\u30ec\u30b9\u304c\u9069\u5207\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ107.S=\u6b63\u3057\u304f\u306a\u3044\u57cb\u3081\u8fbc\u307f\u3067\u3059\u3002
J108=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u30b7\u30b9\u30c6\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3057\u3066\u3044\u307e\u305b\u3093\u3002
XCY00.S=\u7121\u52b9\u306a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024 ''{0}''\=''{1}''\u3002
J107=\u30d0\u30c3\u30c1\u30a8\u30ec\u30e1\u30f3\u30c8 \# \u306e\u30a8\u30e9\u30fc\u3067\u3059
J105=\u7cbe\u5ea6\u304c 31 \u6841\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
J104=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XJ095.S=\u7279\u6a29\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3057\u3088\u3046\u3068\u3057\u3066\u5931\u6557\u3057\u307e\u3057\u305f\u3002
J103=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u4e2d\u306b\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002 {0}
J102=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u59cb\u52d5\u306e\u9593\u306b\u3001\u4f8b\u5916\u304c\u30b9\u30ed\u30fc\u3055\u308c\u307e\u3057\u305f\u3002 {0}
J101=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9 {0} \u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002 {1}  derbynet.jar \u30d5\u30a1\u30a4\u30eb\u306e\u4fdd\u5168\u6027\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
J100=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u30af\u30e9\u30b9\u30d1\u30b9\u306b\u306f derbynet.jar \u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ103.S=\u8868\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XN001.S=\u4f5c\u696d\u5358\u4f4d\u306e\u9014\u4e2d\u3067\u306f\u3001\u63a5\u7d9a\u306e\u30ea\u30bb\u30c3\u30c8\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ091.S=\u7121\u52b9\u306a\u5f15\u6570\: \u30d1\u30e9\u30e1\u30fc\u30bf\u7d22\u5f15 {0} \u306f OUT \u30d1\u30e9\u30e1\u30fc\u30bf\u3067\u3082 INOUT \u30d1\u30e9\u30e1\u30fc\u30bf\u3067\u3082\u3042\u308a\u307e\u305b\u3093\u3002
XJ067.S=SQL \u30c6\u30ad\u30b9\u30c8\u30fb\u30dd\u30a4\u30f3\u30bf\u30fc\u304c NULL \u3067\u3059\u3002
XJ063.S=Statement.setMaxRows(int maxRows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u5024 ''{0}''\u3002  \u30d1\u30e9\u30e1\u30fc\u30bf\u306f >\= 0 \u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XCL18.S=\u7d50\u679c\u5185\u306e\u5217\u5024\u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u3092 2 \u56de\u53d6\u5f97\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XCL14.S=\u5217\u4f4d\u7f6e ''{0}'' \u306f\u7bc4\u56f2\u5916\u3067\u3059\u3002  \u3053\u306e ResultSet \u306b\u5bfe\u3059\u308b\u5217\u6570\u306f ''{1}'' \u3067\u3059\u3002
08001.C.9=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u540d ''{0}'' \u304c\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u3088\u308a\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u9577\u3092\u8d85\u3048\u3066\u3044\u308b\u305f\u3081\u3001\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
08001.C.8=\u30d1\u30b9\u30ef\u30fc\u30c9\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
08001.C.7=\u30e6\u30fc\u30b6\u30fc ID \u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
08001.C.6=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u9577\u3055 ({0}) \u304c 1 \u304b\u3089 {1} \u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002
08001.C.5=\u30e6\u30fc\u30b6\u30fc ID \u306e\u9577\u3055 ({0}) \u304c 1 \u304b\u3089 {1} \u306e\u7bc4\u56f2\u5916\u3067\u3059\u3002
08001.C.4=\u30bd\u30b1\u30c3\u30c8 ''{0}'' \u3067\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u958b\u3051\u307e\u305b\u3093\u3002
08001.C.3=SocketException\: ''{0}''
08001.C.2={0}\: \u30dd\u30fc\u30c8 {2} \u306e\u30b5\u30fc\u30d0\u30fc {1} \u3078\u306e\u63a5\u7d9a\u4e2d\u306b\u30e1\u30c3\u30bb\u30fc\u30b8 {3} \u3067\u30a8\u30e9\u30fc\u306b\u306a\u308a\u307e\u3057\u305f\u3002
XJ128.S=''{0}'' \u306b\u3064\u3044\u3066\u30a2\u30f3\u30e9\u30c3\u30d7\u3067\u304d\u307e\u305b\u3093\u3002
08001.C.1=\u5fc5\u8981\u306a Derby DataSource \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc {0} \u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XJ124.S=\u5217\u306f\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002
08004=\u63a5\u7d9a\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f\: {0}
08003=\u73fe\u884c\u63a5\u7d9a\u306a\u3057\u3002
08000=\u4e0d\u660e\u306e\u5272\u308a\u8fbc\u307f\u306b\u3088\u308a\u3001\u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
XJ088.S=\u7121\u52b9\u306a\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\: \u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u305b\u305a\u306b wasNull() \u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
XJ217.S=\u3053\u306e CLOB/BLOB \u306b\u6307\u5b9a\u3055\u308c\u305f\u30ed\u30b1\u30fc\u30bf\u30fc\u306f\u7121\u52b9\u3067\u3059
XJ084.U=\u5217\u304c\u57fa\u672c\u8868\u306e\u5217\u306b\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u305b\u3093\u3002 \u3053\u306e\u5217\u306b\u5bfe\u3057\u3066 ''{0}'' \u3092\u767a\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ05B.C=JDBC \u5c5e\u6027 ''{0}'' \u306e\u5024 ''{1}'' \u306f\u7121\u52b9\u3067\u3059\u3002\u6709\u52b9\u306a\u5024\u306f ''{2}'' \u3067\u3059\u3002
XJ080.S=USING \u5b9f\u884c\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u304c {1} \u3067\u306f\u306a\u304f {0} \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6e21\u3057\u307e\u3057\u305f\u3002
XJ056.S=XA \u63a5\u7d9a\u306e\u5834\u5408\u3001AUTOCOMMIT ON \u3092\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
XJ213.C=traceLevel \u63a5\u7d9a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u6570\u5024\u306b\u5bfe\u3057\u3066\u6709\u52b9\u306a\u5f62\u5f0f\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
XCL31.S=\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306f\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
J031=\u6587\u5b57\u30c7\u30fc\u30bf\u578b\u306e\u7167\u5408\u9806\u5e8f
XN019.S={0} \u306e\u5b9f\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u3001\u30b5\u30fc\u30d0\u30fc\u306f {1} \u3092\u623b\u3057\u307e\u3057\u305f\u3002
XJ028.C=URL ''{0}'' \u306e\u5f62\u5f0f\u304c\u6b63\u3057\u304f\u3042\u308a\u307e\u305b\u3093\u3002
XJ020.S=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u578b\u304c TYPE ''{0}'' \u306b\u5909\u63db\u53ef\u80fd\u3067\u306a\u3044\u304b\u3001java.sql.Types \u5024\u304c\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u3042\u308b\u3044\u306f\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c NULL \u3067\u3057\u305f\u3002
XJ117.S=\u7167\u4f1a\u306e\u30d0\u30c3\u30c1\u51e6\u7406\u306f J2EE \u4ed5\u69d8\u3078\u306e\u6e96\u62e0\u306e\u305f\u3081\u306b\u3001\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XN015.S=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\: \u6307\u5b9a\u3055\u308c\u305f InputStream \u306e\u30b5\u30a4\u30ba (\u30d1\u30e9\u30e1\u30fc\u30bf \#{0}) \u304c\u5b9f\u969b\u306e InputStream \u306e\u9577\u3055\u3088\u308a\u77ed\u304f\u306a\u3063\u3066\u3044\u307e\u3059\u3002
XJ113.S=\u30d5\u30a1\u30a4\u30eb {0} \u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\: {1}
J028=\u30ed\u30fc\u30eb\u30d5\u30a9\u30ef\u30fc\u30c9\u30fb\u30ea\u30ab\u30d0\u30ea\u30fc\u306e\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30d1\u30b9
J025=\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u30fb\u30d1\u30b9
XN011.S=\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u540d\u306e\u9577\u3055 {0} \u304c\u6709\u52b9\u306a\u7bc4\u56f2\u3067\u3042\u308b 1 \u304b\u3089 {1} \u306e\u4e2d\u306b\u3042\u308a\u307e\u305b\u3093\u3002
J023=\u30e6\u30fc\u30b6\u30fc\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9
J022=\u30e6\u30fc\u30b6\u30fc\u540d
J021=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u7528\u306e\u30c6\u30ea\u30c8\u30ea\u30fc
XJ077.S=getBytes/getSubString \u3092\u4f7f\u7528\u3057\u3066 BLOB/CLOB \u30d1\u30bf\u30fc\u30f3\u306e\u6700\u521d\u306e\u30d0\u30a4\u30c8/\u6587\u5b57\u3092\u8aad\u307f\u53d6\u308d\u3046\u3068\u3057\u3066\u3001\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
J020=\u79d8\u5bc6\u6697\u53f7\u9375
XJ206.S=SQL \u30c6\u30ad\u30b9\u30c8 ''{0}'' \u306b\u30c8\u30fc\u30af\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
XJ073.S=\u3053\u306e BLOB \u307e\u305f\u306f CLOB \u306e\u30c7\u30fc\u30bf\u306f\u3082\u3046\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002  BLOB/CLOB \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30b3\u30df\u30c3\u30c8\u3055\u308c\u3066\u3044\u308b\u304b\u3001\u63a5\u7d9a\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
XJ202.S=\u7121\u52b9\u306a\u30ab\u30fc\u30bd\u30eb\u540d ''{0}'' \u3067\u3059\u3002
0A000.S=\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306f\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\: {0}\u3002
XJ045.S=\u7121\u52b9\u307e\u305f\u306f (\u73fe\u5728) \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u5206\u96e2\u30ec\u30d9\u30eb ''{0}'' \u304c Connection.setTransactionIsolation() \u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002 \u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u5024\u306f\u3001java.sql.Connection.TRANSACTION_SERIALIZABLE\u3001java.sql.Connection.TRANSACTION_REPEATABLE_READ\u3001java.sql.Connection.TRANSACTION_READ_COMMITTED\u3001\u304a\u3088\u3073 java.sql.Connection.TRANSACTION_READ_UNCOMMITTED \u3067\u3059\u3002
J019=\u5916\u90e8\u6697\u53f7\u9375
J018=\u6697\u53f7\u9375\u306e\u9577\u3055
J017=\u6697\u53f7\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
J016=\u6697\u53f7\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
J013=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9
58014.C=DDM \u30b3\u30de\u30f3\u30c9 0x{0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ049.C=\u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u306e\u4f5c\u6210\u3067\u7af6\u5408\u304c\u3042\u308a\u307e\u3059\u3002
J010=\u30c7\u30a3\u30b9\u30af\u4e0a\u3067\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6697\u53f7\u5316
XJ017.S=savepoint \u30b3\u30de\u30f3\u30c9\u306f\u3001\u30c8\u30ea\u30ac\u30fc\u30fb\u30b3\u30fc\u30c9\u5185\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
58010.C=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb\u30fb\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002  \u30ec\u30d9\u30eb {1} \u306e\u30de\u30cd\u30fc\u30b8\u30e3\u30fc {0} \u306f\u30b5\u30fc\u30d0\u30fc\u306b\u3088\u308a\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u305f\u3081\u3001\u63a5\u7d9a\u3092\u78ba\u7acb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 
XJ013.S=\u540d\u524d\u4ed8\u304d\u306e\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306b ID \u304c\u3042\u308a\u307e\u305b\u3093\u3002
XJ041.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XN008.S=\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u306e\u30a8\u30e9\u30fc\u306b\u3088\u308a\u7167\u4f1a\u306e\u51e6\u7406\u304c\u7d42\u4e86\u3057\u307e\u3057\u305f\u3002
XJ098.S=\u81ea\u52d5\u751f\u6210\u3055\u308c\u305f\u30ad\u30fc\u5024 {0} \u306f\u7121\u52b9\u3067\u3059\u3002
42622=\u540d\u524d ''{0}'' \u306f\u9577\u3059\u304e\u307e\u3059\u3002 \u6700\u5927\u9577\u306f ''{1}'' \u3067\u3059\u3002
J008=\u8a73\u7d30\u306a\u3057
XJ106.S=\u305d\u306e\u3088\u3046\u306a\u57cb\u3081\u8fbc\u307f\u306f\u3042\u308a\u307e\u305b\u3093\u3002 
J007=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u4f5c\u6210
J005=Derby \u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3
J004=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ID
XJ094.S=\u3053\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XJ090.S=\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\: \u30ab\u30ec\u30f3\u30c0\u304c NULL \u3067\u3059\u3002
XJ066.S=Statement.setMaxFieldSize(int max) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
3B502.S=RELEASE \u307e\u305f\u306f ROLLBACK TO SAVEPOINT \u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
XJ062.S=ResultSet.setFetchSize(int rows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
XCL13.S=\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u4f4d\u7f6e ''{0}'' \u306f\u7bc4\u56f2\u5916\u3067\u3059\u3002  \u3053\u306e\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u6570\u306f ''{1}'' \u3067\u3059\u3002
24000=\u7121\u52b9\u306a\u30ab\u30fc\u30bd\u30eb\u72b6\u614b - \u73fe\u5728\u884c\u304c\u3042\u308a\u307e\u305b\u3093\u3002
XJ030.S=\u30cd\u30b9\u30c8\u3055\u308c\u305f\u63a5\u7d9a\u3067\u306f\u3001\u81ea\u52d5\u30b3\u30df\u30c3\u30c8\u3092\u30aa\u30f3\u306b\u8a2d\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002
08004.C.11=\u00e3\u0083\u0087\u00e3\u0083\u00bc\u00e3\u0082\u00bf\u00e3\u0083\u0099\u00e3\u0083\u00bc\u00e3\u0082\u00b9 ''{1}'' [{2}] \u00e3\u0082\u0092\u00e4\u00bd\u009c\u00e6\u0088\u0090\u00e3\u0081\u0099\u00e3\u0082\u008b\u00e3\u0081\u009f\u00e3\u0082\u0081\u00e3\u0081\u00ae\u00e3\u0083\u00a6\u00e3\u0083\u00bc\u00e3\u0082\u00b6\u00e3\u0083\u00bc ''{0}'' \u00e3\u0081\u00ae\u00e8\u00a8\u00b1\u00e5\u008f\u00af\u00e3\u0081\u008c\u00e3\u0081\u0082\u00e3\u0082\u008a\u00e3\u0081\u00be\u00e3\u0081\u009b\u00e3\u0082\u0093\u00e3\u0080\u0082
08004.C.10=\u00e3\u0083\u0087\u00e3\u0083\u00bc\u00e3\u0082\u00bf\u00e3\u0083\u0099\u00e3\u0083\u00bc\u00e3\u0082\u00b9 ''{0}'' [{1}] \u00e3\u0082\u0092\u00e4\u00bd\u009c\u00e6\u0088\u0090\u00e3\u0081\u0099\u00e3\u0082\u008b\u00e3\u0081\u009f\u00e3\u0082\u0081\u00e3\u0081\u00ae\u00e3\u0082\u00b7\u00e3\u0082\u00b9\u00e3\u0083\u0086\u00e3\u0083\u00a0\u00e8\u00a8\u00b1\u00e5\u008f\u00af\u00e3\u0082\u0092\u00e7\u00a2\u00ba\u00e8\u00aa\u008d\u00e3\u0081\u00a7\u00e3\u0081\u008d\u00e3\u0081\u00be\u00e3\u0081\u009b\u00e3\u0082\u0093\u00e3\u0080\u0082
XJ123.S=\u73fe\u5728\u884c\u307e\u305f\u306f\u633f\u5165\u884c\u306e\u5024\u3092\u66f4\u65b0\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ087.S=\u4f4d\u7f6e (''{0}'') \u3068\u9577\u3055 (''{1}'') \u306e\u5408\u8a08\u304c LOB \u306e\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
XJ216.S=\u3053\u306e BLOB/CLOB \u306e\u9577\u3055\u306f\u3001\u307e\u3060\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002 BLOB \u307e\u305f\u306f CLOB \u306b\u30b9\u30c8\u30ea\u30fc\u30e0\u3068\u3057\u3066\u30a2\u30af\u30bb\u30b9\u3059\u308b\u5834\u5408\u3001\u30b9\u30c8\u30ea\u30fc\u30e0\u5168\u4f53\u306e\u51e6\u7406\u304c\u5b8c\u4e86\u3059\u308b\u307e\u3067\u3053\u306e\u9577\u3055\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
01J13=\u623b\u3055\u308c\u305f\u884c\u6570 ({0}) \u306f\u3001\u6574\u6570\u3068\u3057\u3066\u683c\u7d0d\u3059\u308b\u306b\u306f\u5927\u304d\u3059\u304e\u307e\u3059\u3002\u623b\u3055\u308c\u305f\u5024\u306f\u5207\u308a\u6368\u3066\u3089\u308c\u307e\u3059\u3002
XJ083.U=\u305d\u306e ResultSet \u306f\u66f4\u65b0\u53ef\u80fd\u306a ResultSet \u3067\u306a\u3044\u305f\u3081\u3001''{0}'' \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002 
01J12=\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c6\u30ad\u30b9\u30c8\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002 \u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30b9\u30c8\u30a2\u30fc\u30c9\u30fb\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc SYSIBM.SQLCAMESSAGE \u306f\u3001\u30b5\u30fc\u30d0\u30fc\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
01J10=\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30bb\u30f3\u30b7\u30c6\u30a3\u30d6\u7d50\u679c\u30bb\u30c3\u30c8\u306f\u30b5\u30fc\u30d0\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u524d\u65b9\u30b9\u30af\u30ed\u30fc\u30eb\u5c02\u7528\u30ab\u30fc\u30bd\u30eb\u306b\u518d\u30de\u30c3\u30d7\u3057\u3066\u3044\u307e\u3059\u3002
XJ212.S=\u7121\u52b9\u306a\u5c5e\u6027\u69cb\u6587\: {0}
XJ059.S=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u3068\u304d\u306b\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
01J08=ResultSet \u578b {0} \u3092\u958b\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002 ResultSet \u578b {1} \u304c\u958b\u304b\u308c\u307e\u3057\u305f\u3002
01J07=\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u304a\u3051\u308b ResultSetHoldability \u306f ResultSet.CLOSE_CURSORS_AT_COMMIT \u306b\u5236\u9650\u3055\u308c\u3066\u3044\u307e\u3059\u3002
01J06=ResultSet \u306f\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3002 \u7167\u4f1a\u306f\u3001\u66f4\u65b0\u53ef\u80fd\u306a ResultSet \u3092\u751f\u6210\u3059\u308b\u3088\u3046\u306b\u4fee\u98fe\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XJ023.S=\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u30c7\u30fc\u30bf\u91cf\u306f\u3001\u8981\u6c42\u3055\u308c\u305f\u9577\u3055\u3068\u5b8c\u5168\u306b\u306f\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XBM0N.D=java.sql.DriverManager \u3078\u306e JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u767b\u9332\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
XN018.S=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\: \u6307\u5b9a\u3055\u308c\u305f Reader \u306e\u30b5\u30a4\u30ba (\u30d1\u30e9\u30e1\u30fc\u30bf \#{0}) \u304c\u5b9f\u969b\u306e Reader \u306e\u9577\u3055\u3088\u308a\u77ed\u304f\u306a\u3063\u3066\u3044\u307e\u3059\u3002
58009.C.21=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: SCLDTA \u306e\u9577\u3055 {0} \u306f RDBNAM \u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.20=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: NVCM\u3001NVCS \u306e\u3046\u3061\u975e\u30cc\u30eb\u306b\u3067\u304d\u308b\u306e\u306f 1 \u3064\u306e\u307f\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ116.S=\u5358\u4e00\u306e\u30d0\u30c3\u30c1\u306b\u8ffd\u52a0\u3067\u304d\u308b\u30b3\u30de\u30f3\u30c9\u306f {0} \u500b\u4ee5\u4e0b\u3067\u3059\u3002
XN014.S=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u30a8\u30e9\u30fc\: IOException \u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30d1\u30e9\u30e1\u30fc\u30bf\u306f \#{0} \u3067\u3059\u3002  \u6b8b\u308a\u306e\u30c7\u30fc\u30bf\u306b\u306f 0x0 \u304c\u57cb\u3081\u8fbc\u307e\u308c\u307e\u3057\u305f\u3002 \u30e1\u30c3\u30bb\u30fc\u30b8\: {1}\u3002
X0Y78.S.2={0}.executeQuery() \u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u7d50\u679c\u30bb\u30c3\u30c8\u304c\u623b\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u7167\u4f1a\u304c\u5b58\u5728\u3057\u306a\u3044\u5834\u5408\u306f\u3001{1}.executeUpdate() \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ112.S=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
X0Y78.S.1=\u8907\u6570\u306e\u7d50\u679c\u30bb\u30c3\u30c8\u304c\u623b\u3055\u308c\u305f\u305f\u3081\u3001{0}.executeQuery() \u3092\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002  \u8907\u6570\u306e\u7d50\u679c\u3092\u53d6\u5f97\u3059\u308b\u306b\u306f {1}.execute() \u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ209.S=\u5fc5\u8981\u306a\u30b9\u30c8\u30a2\u30fc\u30c9\u30fb\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u304c\u30b5\u30fc\u30d0\u30fc\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
XN010.S=\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u540d\u3092 NULL \u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ076.S=\u4f4d\u7f6e\u5f15\u6570 ''{0}'' \u304c BLOB/CLOB \u306e\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u3066\u3044\u307e\u3059\u3002
58009.C.19=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: SECTKN \u304c\u623b\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.18=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: \u7121\u52b9\u306a FDOCA LID \u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.17=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: InputStream (\u30d1\u30e9\u30e1\u30fc\u30bf \#{0}) \u306e\u8aad\u307f\u53d6\u308a\u4e2d\u306b\u4e88\u671f\u305b\u305a\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u7d42\u7aef\u306b\u9054\u3057\u307e\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.16=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: DSS \u30c1\u30a7\u30fc\u30f3\u306e\u6b21\u306e\u30bb\u30b0\u30e1\u30f3\u30c8\u304c\u3001\u73fe\u884c\u306e\u30bb\u30b0\u30e1\u30f3\u30c8\u3068\u540c\u3058 ID \u756a\u53f7 \u3067\u3059\u3002\u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.15=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: \u540c\u4e00\u306e ID \u30c1\u30a7\u30fc\u30f3\u306e\u89e3\u6790\u7d42\u4e86\u6642\u306b\u3001DSS \u306e\u9577\u3055\u304c 0 \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.14=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: \u540c\u4e00\u306e ID \u30c1\u30a7\u30fc\u30f3\u306e\u89e3\u6790\u7d42\u4e86\u6642\u306b\u3001\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u30b9\u30bf\u30c3\u30af\u304c\u7a7a\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.13=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: DDM \u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u306b\u542b\u307e\u308c\u3066\u3044\u308b\u30c7\u30fc\u30bf\u304c 4 \u30d0\u30a4\u30c8\u672a\u6e80\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
42X74=\u7121\u52b9\u306a CALL \u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u69cb\u6587\u3002
58009.C.12=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: \u5b9f\u969b\u306e\u30b3\u30fc\u30c9\u30dd\u30a4\u30f3\u30c8 {0} \u304c\u4e88\u671f\u3055\u308c\u3066\u3044\u305f\u30b3\u30fc\u30c9\u30dd\u30a4\u30f3\u30c8 {1} \u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ072.S=NULL \u30d1\u30bf\u30fc\u30f3\u307e\u305f\u306f searchStr \u304c BLOB \u307e\u305f\u306f CLOB \u4f4d\u7f6e\u30e1\u30bd\u30c3\u30c9\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.11=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30a8\u30f3\u30b3\u30fc\u30c9\u65b9\u5f0f\u3067\u3042\u308b\u305f\u3081\u63a5\u7d9a\u304c\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58009.C.10=\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30d7\u30ed\u30c8\u30b3\u30eb\u4f8b\u5916\: VCM\u3001VCS \u306e\u9577\u3055\u306e\u3046\u3061 0 \u3088\u308a\u5927\u304d\u304f\u3067\u304d\u308b\u306e\u306f 1 \u3064\u306e\u307f\u3067\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
58017.C=DDM \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 0x{0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002  \u5165\u529b\u3055\u308c\u305f\u30db\u30b9\u30c8\u5909\u6570\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u7bc4\u56f2\u5185\u3067\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ044.S=''{0}'' \u306f\u7121\u52b9\u306a\u76ee\u76db\u308a\u3067\u3059\u3002
25001=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u307e\u3060\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u3068\u304d\u306b\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ016.S=\u30e1\u30bd\u30c3\u30c9 ''{0}'' \u306f\u3001\u6e96\u5099\u6e08\u307f\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3067\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ012.S=''{0}'' \u306f\u3059\u3067\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u3066\u3044\u307e\u3059\u3002
XCY02.S=\u8981\u6c42\u3055\u308c\u305f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5909\u66f4\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002''{0}''\=''{1}''\u3002
XJ040.C=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9 ''{0}'' \u3092\u59cb\u52d5\u3067\u304d\u307e\u305b\u3093\u3002\u8a73\u3057\u304f\u306f\u3001\u6b21\u306e\u4f8b\u5916\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
XJ097.S=\u3053\u306e\u63a5\u7d9a\u3067\u4f5c\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u30bb\u30fc\u30d6\u30dd\u30a4\u30f3\u30c8\u306e\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u307e\u305f\u306f\u30ea\u30ea\u30fc\u30b9\u3092\u884c\u3046\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ105.S=DES \u9375\u306e\u9577\u3055\u304c\u8aa4\u3063\u3066\u3044\u307e\u3059\u3002\u4e88\u671f\u3057\u305f\u9577\u3055\u306f {0}\u3001\u5f97\u3089\u308c\u305f\u9577\u3055\u306f {1} \u3067\u3059\u3002
XIE08.S=\u3053\u306e\u540d\u524d\u306e\u5217\u306f\u3042\u308a\u307e\u305b\u3093\: {0}\u3002  
XJ093.S=BLOB/CLOB \u306e\u9577\u3055 {0} \u304c\u9577\u3059\u304e\u307e\u3059\u3002  \u9577\u3055\u304c {1} \u3092\u8d85\u3048\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002
XJ069.S=SetXXX \u30e1\u30bd\u30c3\u30c9\u306f\u3001USING \u5b9f\u884c\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u306e\u5834\u5408\u306b\u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
XJ065.S=Statement.setFetchSize(int rows) \u306b\u5bfe\u3059\u308b\u7121\u52b9\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u5024 ''{0}''\u3002
X0Y79.S=Statement.executeUpdate() \u306f\u3001ResultSet \u3092\u623b\u3059\u30b9\u30c6\u30fc\u30c8\u30e1\u30f3\u30c8\u3092\u4f7f\u3063\u3066\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002
42ZA1=\u30d0\u30c3\u30c1\u5185\u306b\u7121\u52b9\u306a SQL \u304c\u5b58\u5728\u3057\u307e\u3059\: ''{0}''\u3002
XJ061.S=''{0}'' \u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30b9\u30af\u30ed\u30fc\u30eb\u30fb\u30ab\u30fc\u30bd\u30eb\u3067\u306e\u307f\u8a31\u53ef\u3055\u308c\u307e\u3059\u3002
XCL12.S=\u578b ''{0}'' \u306e\u30c7\u30fc\u30bf\u5024\u3092\u578b ''{1}'' \u306e\u30c7\u30fc\u30bf\u5024\u306b\u66f8\u304d\u8fbc\u3082\u3046\u3068\u3057\u307e\u3057\u305f\u3002
XJ009.S=CallableStatement \u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30b9\u30c8\u30a2\u30c9\u30d7\u30ed\u30b7\u30fc\u30b8\u30e3\u30fc\u547c\u3073\u51fa\u3057\u304b\u3001\u51fa\u529b\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u4f7f\u7528\u304c\u5fc5\u8981\u3067\u3059\u3002{0}
XJ126.S=\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u30bb\u30f3\u30b7\u30c6\u30a3\u30d6\u52d5\u7684\u30ab\u30fc\u30bd\u30eb\u306b\u5bfe\u3057\u3066\u547c\u3073\u51fa\u3055\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
XJ122.S=\u3053\u306e\u884c\u306b\u5bfe\u3057\u3066 updateXXX \u30e1\u30bd\u30c3\u30c9\u304c\u547c\u3073\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
XJ001.U=Java \u4f8b\u5916\: ''{1}\: {0}''\u3002
XJ086.S=\u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f\u3001\u30ab\u30fc\u30bd\u30eb\u304c\u633f\u5165\u884c\u306b\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u3053\u306e ResultSet \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u4e26\u884c\u6027\u304c CONCUR_READ_ONLY \u3067\u3042\u308b\u5834\u5408\u306f\u547c\u3073\u51fa\u305b\u307e\u305b\u3093\u3002
XJ215.S=free() \u30e1\u30bd\u30c3\u30c9\u306e\u547c\u3073\u51fa\u3057\u5f8c\u3001\u307e\u305f\u306f BLOB/CLOB \u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u30b3\u30df\u30c3\u30c8\u307e\u305f\u306f\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u5f8c\u306b\u3001\u305d\u306e\u4ed6\u306e java.sql.Clob/java.sql.Blob \u30e1\u30bd\u30c3\u30c9\u3092\u547c\u3073\u51fa\u3059\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
XJ082.U=BLOB/CLOB \u5024\u306f\u3001\u30e1\u30bd\u30c3\u30c9\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u307e\u305f\u306f\u53d7\u4fe1\u5074\u3068\u3057\u3066\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
57017.C=\u30bd\u30fc\u30b9\u30fb\u30b3\u30fc\u30c9\u30fb\u30da\u30fc\u30b8 {0} \u304b\u3089\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30b3\u30fc\u30c9\u30fb\u30da\u30fc\u30b8 {1} \u3078\u306e\u5909\u63db\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002  \u63a5\u7d9a\u306f\u7d42\u4e86\u3055\u308c\u307e\u3057\u305f\u3002
XJ211.S=\u30d0\u30c3\u30c1\u51e6\u7406\u4e2d\u306b\u30ea\u30ab\u30d0\u30ea\u30fc\u4e0d\u80fd\u306a\u9023\u9396\u5206\u65ad\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u30d0\u30c3\u30c1\u306f\u975e\u30a2\u30c8\u30df\u30c3\u30af\u306b\u7d42\u4e86\u3057\u307e\u3059\u3002
XJ058.S=Connection \u3092\u4f7f\u3063\u3066\u30b0\u30ed\u30fc\u30d0\u30eb\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30b3\u30df\u30c3\u30c8\u30fb\u30d7\u30ed\u30bb\u30b9\u306f\u3001XAResource \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
XJ050.U=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306f\u3001\u30d0\u30fc\u30b8\u30e7\u30f3 {0} \u304b\u3089\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002\u30d0\u30fc\u30b8\u30e7\u30f3 {1} \u306b\u30a2\u30c3\u30d7\u30b0\u30ec\u30fc\u30c9\u3067\u304d\u308b\u3088\u3046\u306b\u3001JDBC \u63a5\u7d9a URL \u306b\u5c5e\u6027 ''upgrade\=true'' \u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
