#Tue Apr 14 13:11:04 PDT 2009
XJ111.S=O nome da tabela estrangeira n\u00e3o pode ser nulo.
XJ020.S=O tipo do objeto n\u00e3o pode ser convertido para o tipo ''{0}'', valor inv\u00e1lido de java.sql.Type, ou o objeto era nulo.
XJ200.S=Foi excedido o n\u00famero m\u00e1ximo de sess\u00f5es {0}
XCL31.S=Instru\u00e7\u00e3o fechada.
XCL18.S=O fluxo do valor da coluna no resultado n\u00e3o pode ser trazido duas vezes.
58010.C=Foi encontrado um erro de protocolo de rede.  N\u00e3o foi poss\u00edvel estabelecer uma conex\u00e3o, porque o gerenciador {0} no n\u00edvel {1} n\u00e3o \u00e9 suportado pelo servidor.
XJ091.S=Argumento inv\u00e1lido\: o \u00edndice do par\u00e2metro {0} n\u00e3o \u00e9 um par\u00e2metro OUT ou INOUT.
XJ078.S=O deslocamento ''{0}'' \u00e9 menor que zero, ou \u00e9 muito grande para o BLOB/CLOB corrente.
XN009.S=Erro ao obter o comprimento do objeto BLOB/CLOB, segue a exce\u00e7\u00e3o.
XJ076.S=O argumento de posicionamento ''{0}'' excede o tamanho de BLOB/CLOB.
XCL14.S=A posi\u00e7\u00e3o da coluna ''{0}'' est\u00e1 fora da faixa.  O n\u00famero de colunas desse ResultSet \u00e9 ''{1}''.
J109=Detectada uma configura\u00e7\u00e3o cliente de TCP/IP n\u00e3o apropriada.  N\u00e3o foi pos\u00edvel detectar o endere\u00e7o de IP do hospedeiro local\: ''{0}''.  Cerifique-se que a m\u00e1quina cliente possui um endere\u00e7o de IP configurado de forma apropriada.
XJ074.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setQueryTimeout(int seconds).
J108=O gerenciador de seguran\u00e7a n\u00e3o permite acesso \u00e0 propriedade do sistema {0}.
J107=Erro para o elemento do lote n\u00ba
XJ001.U=Exce\u00e7\u00e3o Java\: ''{1}\: {0}''.
J105=A precis\u00e3o excede 31 d\u00edgitos\!
J104=O objeto j\u00e1 se encontra fechado.
J103=Foi lan\u00e7ada uma exce\u00e7\u00e3o durante o encerramento do servidor de rede. {0}
XCL12.S=Tentativa de colocar um valor de dados do tipo ''{0}'' em um valor de dados do tipo ''{1}''.
J102=Foi lan\u00e7ada uma exce\u00e7\u00e3o durante a inicializa\u00e7\u00e3o do servidor de rede. {0}
XJ072.S=Padr\u00e3o nulo, ou ''searchStr'' passada para um m\u00e9todo de posicionamento BLOB ou CLOB.
J101=Imposs\u00edvel carregar a classe de servidor de rede, {0}. {1}  Verifique a integridade de seu arquivo derbynet.jar.
XJ059.S=N\u00e3o \u00e9 poss\u00edvel fechar uma conex\u00e3o enquanto uma transa\u00e7\u00e3o global ainda est\u00e1 ativa.
J100=Imposs\u00edvel localizar a classe de servidor de rede, {0}. Seu caminho de classe deve conter derbynet.jar.
08001.C.12=N\u00e3o foi poss\u00edvel estabelecer a conex\u00e3o, porque a senha possui comprimento zero ou \u00e9 maior que o m\u00e1ximo permitido pelo protocolo de rede.
08001.C.11=N\u00e3o foi poss\u00edvel estabelecer a conex\u00e3o, porque a identifica\u00e7\u00e3o do usu\u00e1rio possui comprimento zero ou \u00e9 maior que o m\u00e1ximo permitido pelo protocolo de rede.
08001.C.10=N\u00e3o foi poss\u00edvel estabelecer a conex\u00e3o, porque o token de seguran\u00e7a \u00e9 maior que o m\u00e1ximo permitido pelo protocolo de rede.
XJ070.S=Argumento de posi\u00e7\u00e3o zero ou negativa ''{0}'' passado para um m\u00e9todo Blob ou Clob.
XJ057.S=N\u00e3o \u00e9 poss\u00edvel efetivar uma transa\u00e7\u00e3o global utilizando ''Connection'', o processamento da efetiva\u00e7\u00e3o deve seguir atrav\u00e9s da interface XAResource.
XBM0N.D=Falha ao registrar o Driver JDBC com java.sql.DriverManager. Consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
XN001.S=N\u00e3o \u00e9 permitida a redefini\u00e7\u00e3o da conex\u00e3o quando se est\u00e1 dentro de uma unidade de trabalho.
22028=A cadeia de caracteres excede o comprimento m\u00e1ximo de {0}.
08004.C.3=Conex\u00e3o com o banco de dados recusada.
08004.C.2=A conex\u00e3o foi recusada, porque o banco de dados {0} n\u00e3o foi encontrado.
08004=Conex\u00e3o recusada \: {0}
08004.C.1=Ocorreu uma falha de autentica\u00e7\u00e3o da conex\u00e3o.  Motivo\: {0}.
08003=Nenhuma conex\u00e3o corrente.
08000=Conex\u00e3o encerrada por interrup\u00e7\u00e3o desconhecida.
22003.S.3=Ocorreu um estouro durante convers\u00e3o de tipo de dado num\u00e9rico de ''{0}'' para {1}.
22003.S.2=Decimais podem ter no m\u00e1ximo 31 d\u00edgitos.
22003.S.1=O ano ({0}) excede o m\u00e1ximo ''{1}''.
XJ125.S=Este m\u00e9todo somente deve ser chamado em objetos ResultSet com rolamento (tipo TYPE_SCROLL_INSENSITIVE).
22018=Formato de cadeia de caracteres inv\u00e1lido para o tipo {0}.
XCY02.S=A altera\u00e7\u00e3o da propriedade solicitada n\u00e3o \u00e9 suportada ''{0}''\=''{1}''.
XJ214.S=Ocorreu um erro de E/S ao chamar ''free()'' para um CLOB ou BLOB.
0A000.S=Funcionalidade n\u00e3o implementada\: {0}.
57017.C=N\u00e3o existe convers\u00e3o dispon\u00edvel da p\u00e1gina de c\u00f3digo de origem , {0}, para a p\u00e1gina de c\u00f3digo de destino, {1}.  A conex\u00e3o foi encerrada.
XJ123.S=Este m\u00e9todo deve ser chamado para atualizar valores na linha corrente ou na linha de inser\u00e7\u00e3o.
XCY00.S=Valor inv\u00e1lido para a propriedade ''{0}''\=''{1}''.
XJ212.S=A sintaxe do atributo n\u00e3o \u00e9 v\u00e1lida\: {0}
XJ121.S=Opera\u00e7\u00e3o inv\u00e1lida na posi\u00e7\u00e3o corrente do cursor.
XJ108.S=Tamanho de bloco ilegal.
XJ030.S=N\u00e3o \u00e9 poss\u00edvel definir AUTOCOMMIT ON durante uma conex\u00e3o aninhada.
XJ210.S=N\u00e3o foi encontrado o nome do m\u00f3dulo de carga para o procedimento armazenado no servidor.
X0Y79.S=N\u00e3o pode ser chamado Statement.executeUpdate() com uma instru\u00e7\u00e3o que retorna ResultSet.
XJ017.S=N\u00e3o \u00e9 permitida a presen\u00e7a do comando SAVEPOINT dentro do c\u00f3digo do gatilho.
XJ088.S=Opera\u00e7\u00e3o inv\u00e1lida\: foi chamado wasNull() sem nenhum dado buscado.
XJ106.S=N\u00e3o existe este tipo de preenchimento
XN019.S=Erro ao executar {0}, o servidor retornou {1}.
XJ086.S=Este m\u00e9todo n\u00e3o pode ser chamado, a n\u00e3o ser que o cursor esteja posicionado na linha de inser\u00e7\u00e3o.
XJ104.S=O comprimento da chave compartilhada n\u00e3o \u00e9 v\u00e1lido\: {0}.
XJ015.M=Encerramento do sistema Derby.
XN017.S=Erro do protocolo de rede\: encontrado um fim prematuro do fluxo, par\u00e2metro n\u00ba{0}.  Restante dos dados preenchido com 0x0.
XJ013.S=Nenhum ID para pontos de salvamento com nome.
XJ084.U=A coluna n\u00e3o corresponde a uma coluna da tabela base. N\u00e3o \u00e9 poss\u00edvel emitir {0} nessa coluna.
22005=Tentativa de obter um valor de dado do tipo ''{0}'' a partir de um valor de dado do tipo ''{1}''.
XJ04B.S=Lotes n\u00e3o podem conter comandos que tentam retornar conjunto de resultados.
22003=O valor resultante est\u00e1 fora da faixa para o tipo de dado {0}.
XN015.S=Erro do protocolo de rede\: o tamanho da InputStream especificado, par\u00e2metro n\u00ba{0}, \u00e9 menor que o comprimento da InputStream verdadeira.
XJ011.S=N\u00e3o \u00e9 poss\u00edvel passar nulo para o nome do ponto de salvamento.
XJ082.U=N\u00e3o s\u00e3o permitidos valores BLOB/CLOB como par\u00e2metros ou receptores de m\u00e9todos.
XJ069.S=N\u00e3o \u00e9 permitido nenhum m\u00e9todo SetXXX no caso da instru\u00e7\u00e3o de execu\u00e7\u00e3o USING.
XJ100.S=A escala fornecida pelo m\u00e9todo ''registerOutParameter'' n\u00e3o corresponde \u00e0 do m\u00e9todo definidor. Poss\u00edvel perda de precis\u00e3o\!
XN013.S=A orienta\u00e7\u00e3o do rolamento n\u00e3o \u00e9 v\u00e1lida.
01J13=O n\u00famero de linhas retornadas ({0}) \u00e9 muito grande para caber em um inteiro; o valor retornado ser\u00e1 truncado.
XJ080.S=A instru\u00e7\u00e3o de execu\u00e7\u00e3o USING passou {0} par\u00e2metros em vez de {1}.
01J12=N\u00e3o foi poss\u00edvel obter o texto da mensagem no servidor. Consulte a pr\u00f3xima exce\u00e7\u00e3o. O procedimento armazenado SYSIBM.SQLCAMESSAGE n\u00e3o est\u00e1 instalado no servidor. Por favor contacte o administrador do banco de dados.
XJ067.S=O ponteiro de texto SQL \u00e9 nulo.
01J10=N\u00e3o s\u00e3o suportados pelo servidor conjuntos de resultados sens\u00edveis ao rolamento; remapeando para cursor apenas de avan\u00e7o.
XN011.S=O comprimento do nome do procedimento {0} n\u00e3o est\u00e1 dentro da faixa v\u00e1lida de 1 a {1}.
58009.C.9=Exce\u00e7\u00e3o do protocolo de rede\: o comprimento de PKGNAMCSN, {0}, n\u00e3o \u00e9 v\u00e1lido em SQLAM {1}.  A conex\u00e3o foi encerrada.
58009.C.8=Exce\u00e7\u00e3o do protocolo de rede\: o comprimento de SCLDTA, {0}, n\u00e3o \u00e9 v\u00e1lido para PKGID.  A conex\u00e3o foi encerrada.
XIE08.S=N\u00e3o existe uma coluna chamada\: {0}.
58009.C.7=Exce\u00e7\u00e3o do protocolo de rede\: o comprimento de SCLDTA, {0}, n\u00e3o \u00e9 v\u00e1lido para RDBCOLID.  A conex\u00e3o foi encerrada.
XJ065.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setFetchSize(int rows).
XJ063.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setMaxRows(int maxRows).  O valor do par\u00e2metro deve ser >\= 0.
X0Y78.S.2=Foi chamado {0}.executeQuery(), mas n\u00e3o foi retornado nenhum resultado. Utilize {1}.executeUpdate() para o que n\u00e3o for consulta.
X0Y78.S.1=N\u00e3o p\u00f4de ser chamado {0}.executeQuery(), porque foram retornados v\u00e1rios conjuntos de resultados.  Para obter v\u00e1rios resultados deve ser utilizado {1}.execute().
XJ061.S=O m\u00e9todo ''{0}'' \u00e9 permitido apenas nos cursores com rolamento.
01J08=N\u00e3o foi poss\u00edvel abrir o resultSet tipo {0}. Foi aberto o ResultSet tipo {1}.
01J07=ResultSetHoldability restrito a ResultSet.CLOSE_CURSORS_AT_COMMIT para transa\u00e7\u00e3o global.
01J06=ResultSet n\u00e3o atualiz\u00e1vel. A consulta n\u00e3o se qualifica para gerar um conjunto de resultados atualiz\u00e1vel.
XCL16.S.1=O ResultSet n\u00e3o est\u00e1 abero.  Verifique se a auto-efetiva\u00e7\u00e3o est\u00e1 desabilitada.
J028=caminho de backup para recupera\u00e7\u00e3o de avan\u00e7o
XJ044.S=''{0}'' n\u00e3o \u00e9 uma escala v\u00e1lida.
J025=registrar caminho do diret\u00f3rio
J023=senha do usu\u00e1rio
08003.C.3=A conex\u00e3o f\u00edsica subjacente est\u00e1 com problema ou fechada.
J022=nome do usu\u00e1rio
08003.C.2=M\u00e9todo Lob chamado ap\u00f3s a conex\u00e3o ter sido fechada.
J021=territ\u00f3rio do banco de dados
08003.C.1=getConnection() n\u00e3o \u00e9 v\u00e1lido em uma PooledConnection fechada.
J020=chave secreta criptografada
XJ042.S=''{0}'' n\u00e3o \u00e9 um valor v\u00e1lido para a propriedade ''{1}''.
XJ209.S=O procedimento armazenado requisitado n\u00e3o est\u00e1 instalado no servidor.
XJ118.S=Consulta em lote requisitada em uma instru\u00e7\u00e3o que n\u00e3o \u00e9 de consulta.
XJ207.S=O m\u00e9todo ''executeQuery'' n\u00e3o pode ser utilizado para atualiza\u00e7\u00f5es.
58017.C=O valor do par\u00e2metro DDM 0x{0} n\u00e3o \u00e9 suportado.  Uma vari\u00e1vel hospedeira de entrada pode n\u00e3o estar no intervalo que o servidor admite.  A conex\u00e3o foi encerrada.
XJ098.S=O valor das chaves autogeradas {0} n\u00e3o \u00e9 v\u00e1lida.
XJ116.S=N\u00e3o podem ser adicionados mais de {0} comandos a um \u00fanico lote.
XJ025.S=O fluxo de entrada n\u00e3o pode ter comprimento negativo.
XJ096.S=N\u00e3o foi poss\u00edvel encontrar um pacote de recursos no {0} pacote para {1}
58015.C=O objeto DDM 0x{0} n\u00e3o \u00e9 suportado.  A conex\u00e3o foi encerrada.
XJ114.S=O nome do cursor n\u00e3o \u00e9 v\u00e1lido ''{0}''
XJ023.S=O fluxo de entrada n\u00e3o cont\u00e9m a quantidade exata de dados do comprimento requisitado.
J019=chave externa criptografada
XJ203.S=O cursor com nome ''{0}'' j\u00e1 est\u00e1 em uso.
J018=comprimento de chave criptografada
XJ040.C=Falha ao iniciar o banco de dados ''{0}'', consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
J017=algoritmo criptografado
J016=provedor de servi\u00e7os criptografados
XJ094.S=Este objeto j\u00e1 se encontra fechado.
XJ112.S=Ocorreu uma exce\u00e7\u00e3o de seguran\u00e7a, consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
J013=fazer upgrade do banco de dados
42622=O nome ''{0}'' \u00e9 muito longo. O comprimento m\u00e1ximo \u00e9 ''{1}''.
XJ021.S=O tipo n\u00e3o \u00e9 suportado.
22007.S.181=A sintaxe da representa\u00e7\u00e3o cadeia de caracteres do valor DATETIME est\u00e1 incorreta.
XJ008.S=N\u00e3o \u00e9 poss\u00edvel liberar ou desfazer at\u00e9 um ponto de salvamento quando se est\u00e1 no modo de auto-efetiva\u00e7\u00e3o.
J010=criptografar banco de dados no disco
XJ110.S=O nome da tabela prim\u00e1ria n\u00e3o pode ser nulo.
XJ079.S=O comprimento especificado ''{0}'' excede o tamanho do BLOB/BLOB.
2D521.S.2=COMMIT ou ROLLBACK inv\u00e1lido para o ambiente de execu\u00e7\u00e3o do aplicativo.
2D521.S.1=setAutoCommit(true) n\u00e3o \u00e9 v\u00e1lido durante uma transa\u00e7\u00e3o global.
XJ090.S=Par\u00e2metro inv\u00e1lido\: o calend\u00e1rio \u00e9 nulo.
XJ077.S=Ocorreu uma exce\u00e7\u00e3o ao tentar ler o primeiro byte/caractere do padr\u00e3o BLOB/CLOB utilizando getBytes/getSubString.
58009.C.21=Exce\u00e7\u00e3o do protocolo de rede\: o comprimento em SCLDTA, {0}, n\u00e3o \u00e9 v\u00e1lido para RDBNAM.  A conex\u00e3o foi encerrada.
58009.C.20=Exce\u00e7\u00e3o do protocolo de rede\: somente um entre NVCM e NVCS pode ser n\u00e3o-nulo.  A conex\u00e3o foi encerrada.
XJ05B.C=O atributo JDBC ''{0}'' possui um valor inv\u00e1lido ''{1}'', os valores v\u00e1lidos s\u00e3o ''{2}''.
XN008.S=O processamento do comando foi terminado devido a um erro no servidor.
XCL13.S=A posi\u00e7\u00e3o do par\u00e2metro ''{0}'' est\u00e1 fora da faixa.  O n\u00famero de par\u00e2metros desta instru\u00e7\u00e3o preparada \u00e9 ''{1}''.
08006.C.6=Tentativa de materializar completamente dados LOB muito grandes para a JVM.  A conex\u00e3o foi encerrada.
08006.C.5=Dados insuficientes ao ler da rede - esperado um m\u00ednimo de {0} bytes mas recebido apenas {1} bytes.  A conex\u00e3o foi encerrada.
J008=nenhum detalhe
XJ073.S=Os dados neste BLOB ou CLOB n\u00e3o est\u00e3o mais dispon\u00edveis.  A transa\u00e7\u00e3o do BLOB ou CLOB pode ter sido efetivada, ou sua conex\u00e3o est\u00e1 fechada.
08006.C.4=Ocorreu um erro durante uma redefini\u00e7\u00e3o de conex\u00e3o postergada e a conex\u00e3o foi encerrada.  Consulte as exce\u00e7\u00f5es encadeadas para obter detalhes.
J007=criar banco de dados
08006.C.3=Foi detectado um erro de comunica\u00e7\u00e3o\: {0}.
08006.C.2=SocketException\: ''{0}''
J005=encerrar Derby
08006.C.1=Ocorreu um erro durante a redefini\u00e7\u00e3o da conex\u00e3o, e a conex\u00e3o foi encerrada.  Consulte as exce\u00e7\u00f5es encadeadas para obter detalhes.
J004=identidade do banco de dados
XJ004.C=Banco de dados ''{0}'' n\u00e3o encontrado.
XJ071.S=Argumento com comprimento zero ou negativo ''{0}'' passado para um m\u00e9todo Blob ou Clob.
22005.S.6=Tipo SQL Java n\u00e3o reconhecido {0}.
22005.S.5=Tipo JDBC inv\u00e1lido para o par\u00e2metro {0}.
XN002.U=N\u00e3o foi retornado SECTKN.
XJ058.S=N\u00e3o \u00e9 poss\u00edvel desfazer uma transa\u00e7\u00e3o global utilizando ''Connection'', o processamento da efetiva\u00e7\u00e3o deve seguir atrav\u00e9s da interface XAResource.
22005.S.4=Tipo JDBC n\u00e3o reconhecido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
58009.C.19=Exce\u00e7\u00e3o do protocolo de rede\: n\u00e3o foi retornado SECTKN.  A conex\u00e3o foi encerrada.
22005.S.3=Cadeia de caracteres UNICODE n\u00e3o pode ser convertida em cadeia de caracteres EBCDIC.
58009.C.18=Exce\u00e7\u00e3o do protocolo de rede\: FDOCA LID inv\u00e1lido.  A conex\u00e3o foi encerrada.
22005.S.2=O conversor de caractere requerido n\u00e3o est\u00e1 dispon\u00edvel.
58009.C.17=Exce\u00e7\u00e3o do protocolo de rede\: encontrado fim de fluxo prematuro ao ler de InputStream, par\u00e2metro \#{0}.  A conex\u00e3o foi encerrada.
22005.S.1=N\u00e3o foi poss\u00edvel converter um valor do tipo ''{0}'' para o tipo ''{1}'' \: a codifica\u00e7\u00e3o n\u00e3o \u00e9 suportada.
58009.C.16=Exce\u00e7\u00e3o do protocolo de rede\: DSS encadeada com o mesmo identificador no final do mesmo identificador de an\u00e1lise.  A conex\u00e3o foi encerrada.
58009.C.15=Exce\u00e7\u00e3o do protocolo de rede\: o comprimento de DSS n\u00e3o \u00e9 0 no final do mesmo identificador de an\u00e1lise da cadeia.  A conex\u00e3o foi encerrada.
58009.C.14=Exce\u00e7\u00e3o do protocolo de rede\: pilha da cole\u00e7\u00e3o n\u00e3o est\u00e1 vazia no final do mesmo identificador de an\u00e1lise da cadeia.  A conex\u00e3o foi encerrada.
XJ056.S=N\u00e3o \u00e9 poss\u00edvel definir AUTOCOMMIT ON quando se est\u00e1 em uma conex\u00e3o XA.
58009.C.13=Exce\u00e7\u00e3o do protocolo de rede\: cole\u00e7\u00e3o DDM cont\u00e9m menos de 4 bytes de dados.  A conex\u00e3o foi encerrada.
58009.C.12=Exce\u00e7\u00e3o do protocolo de rede\: ponto de c\u00f3digo real, {0}, n\u00e3o corresponde ao ponto esperado, {1}.  A conex\u00e3o foi encerrada.
58009.C.11=A conex\u00e3o foi encerrada, porque a codifica\u00e7\u00e3o n\u00e3o \u00e9 suportada.
58009.C.10=Exce\u00e7\u00e3o do protocolo de rede\: somente um dos comprimentos de VCM, VCS pode ser maior que 0.  A conex\u00e3o foi encerrada.
XJ050.U=O banco de dados requer atualiza\u00e7\u00e3o da vers\u00e3o {0}, defina o atributo ''upgrade\=true'' na URL de conex\u00e3o JDBC para permitira atualiza\u00e7\u00e3o para a vers\u00e3o {1}.
XJ128.S=N\u00e3o foi poss\u00edvel desempacotar para ''{0}''
XJ126.S=Este m\u00e9todo n\u00e3o deve ser chamado em cursores din\u00e2micos sens\u00edveis.
XJ215.S=N\u00e3o pode ser chamado outro m\u00e9todo de Clob/Blob ap\u00f3s chamar o m\u00e9todo ''free()''.
XJ124.S=A coluna n\u00e3o \u00e9 atualiz\u00e1vel.
XJ122.S=N\u00e3o foi chamado nenhum m\u00e9todo updateXXX para esta linha.
24000=Estado do cursor inv\u00e1lido - nenhuma linha corrente.
XJ018.S=O nome da coluna n\u00e3o pode ser nulo.
XJ211.S=Ocorreu uma exce\u00e7\u00e3o de quebra de cadeia n\u00e3o recuper\u00e1vel durante o processamento em lote. O lote foi terminado de forma n\u00e3o at\u00f4mica.
XJ107.S=Preenchimento com problema
XJ016.S=N\u00e3o permitido o m\u00e9todo ''{0}'' em instru\u00e7\u00e3o preparada.
XJ213.C=A propriedade n\u00edvel de rastraemento (traceLevel) da conex\u00e3o n\u00e3o possui um formato v\u00e1lido para um n\u00famero.
XJ105.S=A chave DES possui um comprimento errado, comprimento esperado {0}, comprimento obtido {1}.
XN018.S=Erro do protocolo de rede\: o tamanho de Reader especificado, par\u00e2metro n\u00ba{0}, \u00e9 menor que o comprimento da InputStream verdadeira.
XJ014.S=Nenhum nome para pontos de salvamento sem nome.
XJ085.S=O fluxo j\u00e1 foi lido e o fim-de-arquivo j\u00e1 foi atingido, n\u00e3o podendo ser reutilizado.
XJ103.S=O nome da tabela n\u00e3o pode ser nulo.
22015.S.1=Convers\u00e3o de dado inv\u00e1lida\: a convers\u00e3o requisitada resultaria em uma perda de precis\u00e3o para {0}
XJ04C.S=O lote CallableStatement n\u00e3o pode conter par\u00e2metros de sa\u00edda.
XN016.S=Erro do protocolo de rede\: encontrado erro na verifica\u00e7\u00e3o do comprimento do fluxo, par\u00e2metro n\u00ba{0}.  Mensagem\: {1}.
XJ012.S=''{0}'' j\u00e1 est\u00e1 fechado.
XJ083.U=''{0}'' n\u00e3o permitido, porque o ResultSet n\u00e3o \u00e9 um ResultSet atualiz\u00e1vel.
42X74=Sintaxe inv\u00e1lida da instru\u00e7\u00e3o CALL.
XN014.S=Erro do protocolo de rede\: encontrada uma IOException, par\u00e2metro n\u00ba{0}.  Restante dos dados preenchido com 0x0. Mensagem\: {1}.
XJ010.S=N\u00e3o \u00e9 poss\u00edvel colocar SAVEPOINT quando o a auto-efetiva\u00e7\u00e3o est\u00e1 ativa.
XCL08.S=O cursor ''{0}'' n\u00e3o est\u00e1 em uma linha.
XJ081.S=Valor inv\u00e1lido ''{0}'' passado como par\u00e2metro ''{1}'' para o m\u00e9todo ''{2}''
XJ068.S=Somente s\u00e3o permitidos ''executeBatch'' e ''clearBatch'' no meio de um lote.
XN012.S=Nas plataformas {0}, o XA suporta a vers\u00e3o {1} ou mais recente, esta vers\u00e3o \u00e9 a {2}
XJ066.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para Statement.setMaxFieldSize(int max).
XN010.S=O nome do procedimento n\u00e3o pode ser nulo.
J133=A senha do usu\u00e1rio para a conex\u00e3o
J132=O nome de usu\u00e1rio para a conex\u00e3o
J130=Foi detectado um erro ''PROTOCOL Invalid FDOCA Description''
XJ064.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para setFetchDirection(int direction).
0A000.S.7=O tipo de dado ''{0}'' n\u00e3o \u00e9 suportado.
XJ081.C=Foram especificados atributos create/restore/recovery conflitantes.
0A000.S.5=O mecanismo de seguran\u00e7a ''{0}'' n\u00e3o \u00e9 suportado.
0A000.S.4=N\u00e3o \u00e9 suportado cancel() pelo servidor.
08006.D=Banco de dados ''{0}'' fechado.
0A000.S.3=A propriedade resultSetHoldability {0} n\u00e3o \u00e9 suportada
08006.C=Foi encontrado um erro de protocolo de rede e a conex\u00e3o foi encerrada\: {0}
0A000.S.2=O m\u00e9todo JDBC {0} n\u00e3o \u00e9 suportado pelo servidor. Por favor atualize o servidor.
24501.S=O cursor identificado n\u00e3o est\u00e1 aberto.
0A000.S.1=O m\u00e9todo JDBC ainda n\u00e3o est\u00e1 implementado.
XJ062.S=Valor de par\u00e2metro inv\u00e1lido ''{0}'' para ResultSet.setFetchSize(int rows).
J129=Foi emitido um comando Open Query para uma consulta que j\u00e1 estava aberta
J128=O cursor n\u00e3o est\u00e1 aberto
XJ045.S=N\u00edvel de isolamento n\u00e3o suportado ou inv\u00e1lido (atualmente), ''{0}'', passado para Connection.setTransactionIsolation(). Os valores suportados atualmente s\u00e3o java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED e java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
J127=O parseSQLDIAGGRP ainda n\u00e3o est\u00e1 implementado
J126=Foi detectado um erro de protocolo conversacional.  Motivo\: 0x{0}.
XJ049.C=Foram especificados atributos de cria\u00e7\u00e3o conflitantes.
J125=Foi encontrado um erro de n\u00e3o correspond\u00eancia de descritor de dados (Data Descriptor Mismatch).
J124=O comando de acesso ao banco de dados relacional (ACCRDB) n\u00e3o p\u00f4de ser emitido, porque o banco de dados j\u00e1 est\u00e1 sendo acessado no momento
J123=O comando requisitado encontrou uma condi\u00e7\u00e3o de arquitetura e especificidade da implementa\u00e7\u00e3o para a qual n\u00e3o existe mensagem arquitetada
J122=O comando requisitando servi\u00e7os do banco de dados foi emitido antes do comando requisitando acesso ao banco de dados (ACCRDB)
J121=O usu\u00e1rio n\u00e3o est\u00e1 autorizado a acessar o banco de dados
J120=n\u00e3o especificado
07000=Pelo menos um par\u00e2metro da instru\u00e7\u00e3o corrente n\u00e3o foi inicializado.
25001=N\u00e3o \u00e9 poss\u00edvel fechar a conex\u00e3o quando a transa\u00e7\u00e3o ainda est\u00e1 ativa.
XJ208.S=Falha de lote n\u00e3o at\u00f4mica.  O lote foi submetido, mas ocorreu pelo menos uma exce\u00e7\u00e3o em um membro individual do lote. Utilize getNextException() para obter as exce\u00e7\u00f5es para os elementos do lote espec\u00edficos.
XJ099.S=O objeto Reader/Stream n\u00e3o cont\u00e9m caracteres de comprimento
XJ117.S=N\u00e3o s\u00e3o permitidas consultas em lote por conformidade com a especifica\u00e7\u00e3o J2EE.
23502=A coluna ''{0}'' n\u00e3o aceita valor nulo.
XJ206.S=O texto SQL ''{0}'' n\u00e3o possui elementos.
42ZA1=SQL inv\u00e1lido no Lote\: ''{0}''.
58016.C=O par\u00e2metro DDM 0x{0} n\u00e3o \u00e9 suportado.  A conex\u00e3o foi encerrada.
XJ097.S=N\u00e3o \u00e9 poss\u00edvel desfazer ou liberar um ponto de salvamento que n\u00e3o foi criado por esta conex\u00e3o.
08001.C.9=N\u00e3o foi poss\u00edvel estabelecer a conex\u00e3o, porque o nome do banco de dados ''{0}'' possui comprimento maior que o m\u00e1ximo permitido pelo protocolo de rede.
XJ115.S=N\u00e3o foi poss\u00edvel abrir o resultSet com a capacidade de reten\u00e7\u00e3o requisitada {0}.
08001.C.8=A senha n\u00e3o pode ser nula.
08001.C.7=A identifica\u00e7\u00e3o do usu\u00e1rio n\u00e3o pode ser nula.
08001.C.6=O comprimento da senha ({0}) est\u00e1 fora do intervalo de 1 a {1}.
XJ041.C=Falha ao criar o banco de dados ''{0}'', consulte a pr\u00f3xima exce\u00e7\u00e3o para obter detalhes.
3B502.S=Foi especificado um RELEASE ou ROLLBACK TO SAVEPOINT , mas o ponto de salvamento n\u00e3o existe.
08001.C.5=O comprimento da identifica\u00e7\u00e3o do usu\u00e1rio ({0}) est\u00e1 fora do intervalo de 1 a {1}.
J118=senha expirada
XJ204.S=N\u00e3o foi poss\u00edvel abrir o conjunto de resultados com a capacidade de reten\u00e7\u00e3o requisitada {0}.
08001.C.4=N\u00e3o foi poss\u00edvel abrir fluxo no soquete\: ''{0}''.
XJ028.C=A URL ''{0}'' n\u00e3o est\u00e1 adequadamente formada.
J117=Faltando SECTKN em ACCSEC quando foi requerido, ou \u00e9 inv\u00e1lido
58014.C=O comando DDM 0x{0} n\u00e3o \u00e9 suportado.  A conex\u00e3o foi encerrada.
08001.C.3=SocketException\: ''{0}''
XJ095.S=Falha na tentativa de executar uma a\u00e7\u00e3o privilegiada.
J116=Erro de servi\u00e7o de seguran\u00e7a local que n\u00e3o pode ser tentado novamente
X0X95.S=N\u00e3o p\u00f4de ser efetuada a opera\u00e7\u00e3o ''{0}'' no objeto ''{1}'', porque h\u00e1 um ResultSet aberto dependente deste objeto.
XJ113.S=N\u00e3o foi poss\u00edvel abrir o arquivo {0} \: {1}
08001.C.2={0} \: Erro ao conectar no servidor ''{1}'' porta ''{2}''. Recebida a mensagem\: ''{3}''.
J115=a nova senha n\u00e3o \u00e9 v\u00e1lida
XJ05C.S=N\u00e3o \u00e9 poss\u00edvel definir a capacidade de reten\u00e7\u00e3o ResultSet.HOLD_CURSORS_OVER_COMMIT para uma transa\u00e7\u00e3o global.
08001.C.1=Propriedade requerida {0} n\u00e3o definida.
J114=identifica\u00e7\u00e3o do usu\u00e1rio revogada
J113=identifica\u00e7\u00e3o do usu\u00e1rio ou senha inv\u00e1lida
0A000.C.6=O comando DRDA {0} n\u00e3o est\u00e1 implementado atualmente.  A conex\u00e3o foi encerrada.
XJ022.S=N\u00e3o foi poss\u00edvel definir o fluxo\: ''{0}''.
J112=faltando a identifica\u00e7\u00e3o do usu\u00e1rio
XJ202.S=Nome inv\u00e1lido de cursor ''{0}''.
XJ009.S=\u00c9 requerido o uso de ''CallableStatement'' para chamada de procedimento armazenado, ou uso de par\u00e2metros de sa\u00edda\: {0}
J111=faltando a senha
J110=mecanismo de seguran\u00e7a n\u00e3o suportado
XJ093.S=O comprimento do BLOB/CLOB, {0}, \u00e9 muito grande.  O comprimento n\u00e3o pode exceder {1}.
