#Tue Apr 14 13:10:56 PDT 2009
XJ111.S=Jm\u00e9no ciz\u00ed tabulky nem\u016f\u017ee m\u00edt hodnotu ''null''
XJ020.S=Typ objektu nen\u00ed p\u0159evoditeln\u00fd na TYP ''{0}'', neplatn\u00e1 hodnota java.sql.Types nebo objekt m\u011bl hodnotu ''null''.
XJ200.S=Byl p\u0159ekro\u010den maxim\u00e1ln\u00ed po\u010det sekc\u00ed {0}
XCL31.S=P\u0159\u00edkaz byl uzav\u0159en.
XCL18.S=Tok dat hodnoty sloupce ve v\u00fdsledku nelze na\u010d\u00edst dvakr\u00e1t
58010.C=Byla zji\u0161t\u011bna chyba s\u00ed\u0165ov\u00e9ho protokolu. Spojen\u00ed nebylo ustanoveno, proto\u017ee spr\u00e1vce {0} na \u00farovni {1} nen\u00ed podporov\u00e1n serverem. 
XJ091.S=Neplatn\u00fd argument\: index parametru {0} nen\u00ed parametrem OUT nebo INOUT.
XJ078.S=Odsazen\u00ed ''{0}'' je bu\u010f men\u0161\u00ed ne\u017e nula, nebo p\u0159\u00edli\u0161 velk\u00e9 pro aktu\u00e1ln\u00ed BLOB/CLOB.
XN009.S=Chyba p\u0159i z\u00edsk\u00e1v\u00e1n\u00ed d\u00e9lky objektu BLOB/CLOB. N\u00e1sleduje v\u00fdjimka.
XJ076.S=Argument pozice ''{0}'' p\u0159ekra\u010duje velikost BLOB/CLOB.
XCL14.S=Pozice sloupce ''{0}'' je mimo rozsah. Po\u010det sloupc\u016f pro tuto mno\u017einu v\u00fdsledk\u016f je ''{1}''.
J109=Byla detekov\u00e1na nespr\u00e1vn\u00e1 konfigurace klienta TCP/IP. Nelze ur\u010dit adresu IP va\u0161eho lok\u00e1ln\u00edho hostitele\: ''{0}''. Ujist\u011bte se, \u017ee v\u00e1\u0161 klientsk\u00fd po\u010d\u00edta\u010d m\u00e1 \u0159\u00e1dn\u011b konfigurovanou adresu IP.
XJ074.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro Statement.setQueryTimeout(int seconds).
J108=Spr\u00e1vce zabezpe\u010den\u00ed nepovoluje p\u0159\u00edstup k vlastnosti syst\u00e9mu {0}.
J107=Chyba prvku d\u00e1vkov\u00e9ho zpracov\u00e1n\u00ed \#
XJ001.U=V\u00fdjimka Javy\: ''{1}\: {0}''.
J105=P\u0159esnost p\u0159ekra\u010duje 31 \u010d\u00edslic\!
J104=Objekt je ji\u017e zav\u0159en.
J103=Do\u0161lo k v\u00fdjimce b\u011bhem vyp\u00edn\u00e1n\u00ed s\u00ed\u0165ov\u00e9ho serveru. {0}
XCL12.S=Byl u\u010din\u011bn pokus o vlo\u017een\u00ed hodnoty dat typu ''{0}'' do hodnoty dat typu ''{1}''.
J102=Do\u0161lo k v\u00fdjimce b\u011bhem spou\u0161t\u011bn\u00ed s\u00ed\u0165ov\u00e9ho serveru. {0}
XJ072.S=Metod\u011b pozice BLOB nebo CLOB byl p\u0159ed\u00e1n vzor s hodnotou ''null'' nebo searchStr.
J101=Nelze zav\u00e9st t\u0159\u00eddu s\u00ed\u0165ov\u00e9ho serveru {0}. {1}  Zkontrolujte integritu va\u0161eho souboru derbynet.jar.
XJ059.S=Nelze zav\u0159\u00edt spojen\u00ed, kdy\u017e je glob\u00e1ln\u00ed transakce st\u00e1le aktivn\u00ed.
J100=Nelze nal\u00e9zt t\u0159\u00eddu s\u00ed\u0165ov\u00e9ho serveru {0}. Va\u0161e cesta ke t\u0159\u00edd\u011b by m\u011bla obsahovat soubor derbynet.jar.
08001.C.12=Spojen\u00ed nebylo ustanoveno, proto\u017ee heslo m\u00e1 nulovou d\u00e9lku nebo je del\u0161\u00ed ne\u017e maximum povolen\u00e9 s\u00ed\u0165ov\u00fdm protokolem.
08001.C.11=Spojen\u00ed nebylo ustanoveno, proto\u017ee ID u\u017eivatele m\u00e1 nulovou d\u00e9lku nebo je del\u0161\u00ed ne\u017e maximum povolen\u00e9 s\u00ed\u0165ov\u00fdm protokolem.
08001.C.10=Spojen\u00ed nebylo ustanoveno, proto\u017ee token zabezpe\u010den\u00ed je v\u011bt\u0161\u00ed ne\u017e maximum povolen\u00e9 s\u00ed\u0165ov\u00fdm protokolem.
XJ070.S=Metod\u011b BLOB nebo CLOB byl p\u0159ed\u00e1n z\u00e1porn\u00fd nebo nulov\u00fd argument pozice ''{0}''.
XJ057.S=Nelze potvrdit glob\u00e1ln\u00ed transakci pomoc\u00ed p\u0159ipojen\u00ed. Zpracov\u00e1n\u00ed potvrzen\u00ed mus\u00ed proj\u00edt rozhran\u00edm XAResource.
XBM0N.D=Registrace ovlada\u010de JDBC u java.sql.DriverManager selhala. Podrobnosti viz dal\u0161\u00ed v\u00fdjimka. 
XN001.S=Resetov\u00e1n\u00ed p\u0159ipojen\u00ed nen\u00ed povoleno, kdy\u017e jste uvnit\u0159 jednotky pr\u00e1ce.
22028=\u0158et\u011bzec p\u0159ekra\u010duje maxim\u00e1ln\u00ed d\u00e9lku {0}.
08004.C.3=P\u0159ipojen\u00ed k datab\u00e1zi bylo odm\u00edtnuto.
08004.C.2=P\u0159ipojen\u00ed bylo odm\u00edtnuto, proto\u017ee datab\u00e1ze {0} nebyla nalezena.
08004=P\u0159ipojen\u00ed bylo odm\u00edtnuto\: {0}
08004.C.1=Vyskytlo se selh\u00e1n\u00ed ov\u011b\u0159en\u00ed p\u0159ipojen\u00ed. D\u016fvod\: {0}.
08003=\u017d\u00e1dn\u00e9 aktu\u00e1ln\u00ed p\u0159ipojen\u00ed.
08000=Spojen\u00ed bylo zav\u0159eno nezn\u00e1m\u00fdm p\u0159eru\u0161en\u00edm.
22003.S.3=Vyskytlo se p\u0159ete\u010den\u00ed b\u011bhem konverze \u010d\u00edseln\u00e9ho datov\u00e9ho typu ''{0}'' na {1}.
22003.S.2=Des\u00edtkov\u00e9 \u010d\u00edslo m\u016f\u017ee m\u00edt maxim\u00e1ln\u011b 31 \u010d\u00edslic.
22003.S.1=Rok ({0}) p\u0159ekra\u010duje maximum ''{1}''.
XJ125.S=Tato metoda by m\u011bla b\u00fdt vol\u00e1na pouze na objekty mno\u017einy v\u00fdsledk\u016f, kter\u00e9 jsou posouvateln\u00e9 (typ TYPE_SCROLL_INSENSITIVE).
22018=Neplatn\u00fd form\u00e1t \u0159et\u011bzce znak\u016f pro typ {0}.
XCY02.S=Po\u017eadovan\u00e1 zm\u011bna vlastnosti nen\u00ed podporov\u00e1na ''{0}''\=''{1}''.
XJ214.S=Vyskytla se chyba I/O p\u0159i vol\u00e1n\u00ed free() na CLOB nebo BLOB.
0A000.S=Funkce nen\u00ed implementov\u00e1na\: {0}.
57017.C=Nen\u00ed k dispozici konverze ze zdrojov\u00e9 k\u00f3dov\u00e9 str\u00e1nky {0} do c\u00edlov\u00e9 k\u00f3dov\u00e9 str\u00e1nky {1}. Spojen\u00ed bylo ukon\u010deno.
XJ123.S=Tato metoda mus\u00ed b\u00fdt vol\u00e1na, aby se aktualizovaly hodnoty v aktu\u00e1ln\u00edm \u0159\u00e1dku nebo \u0159\u00e1dku pro vlo\u017een\u00ed.
XCY00.S=Neplatn\u00e1 hodnota pro vlastnost ''{0}''\=''{1}''.
XJ212.S=Neplatn\u00e1 syntaxe atributu\: {0}
XJ121.S=Neplatn\u00e1 operace na aktu\u00e1ln\u00ed pozici kurzoru.
XJ108.S=Neplatn\u00e1 velikost bloku
XJ030.S=Nelze zapnout automatick\u00e9 potvrzov\u00e1n\u00ed ve vno\u0159en\u00e9m spojen\u00ed.
XJ210.S=Jm\u00e9no modulu zaveden\u00ed pro ulo\u017eenou proceduru na serveru nebylo nalezeno.
X0Y79.S=Statement.executeUpdate() nelze volat s p\u0159\u00edkazem, kter\u00fd vrac\u00ed mno\u017einu v\u00fdsledk\u016f.
XJ017.S=V k\u00f3du triggeru nen\u00ed povolen \u017e\u00e1dn\u00fd p\u0159\u00edkaz bodu ulo\u017een\u00ed.
XJ088.S=Neplatn\u00e1 operace\: bylo vol\u00e1no wasNull() bez na\u010dten\u00fdch dat.
XJ106.S=Neexistuje takov\u00e1 vata 
XN019.S=Chyba p\u0159i prov\u00e1d\u011bn\u00ed p\u0159\u00edkazu {0}, server vr\u00e1til\: {1}.
XJ086.S=Tuto metodu nelze vyvolat, kdy\u017e kurzor nen\u00ed na \u0159\u00e1dku pro vlo\u017een\u00ed nebo kdy\u017e soub\u011b\u017enost tohoto objektu mno\u017einy v\u00fdsledk\u016f je CONCUR_READ_ONLY.
XJ104.S=D\u00e9lka sd\u00edlen\u00e9ho kl\u00ed\u010de je neplatn\u00e1\: {0}.
XJ015.M=Vypnut\u00ed syst\u00e9mu Derby.
XN017.S=Chyba s\u00ed\u0165ov\u00e9ho protokolu\: p\u0159ed\u010dasn\u011b dosa\u017een konec toku dat, parametr \#{0}. Zb\u00fdvaj\u00edc\u00ed data byla vypln\u011bna 0x0.
XJ013.S=\u017d\u00e1dn\u00e9 ID pro jmenovan\u00e9 body ulo\u017een\u00ed.
XJ084.U=Sloupec neodpov\u00edd\u00e1 sloupci v z\u00e1kladn\u00ed tabulce. Nelze vydat ''{0}'' na tento sloupec.
22005=Byl u\u010din\u011bn pokus o z\u00edsk\u00e1n\u00ed hodnoty dat typu ''{0}'' z hodnoty dat typu ''{1}''.
XJ04B.S=D\u00e1vka nem\u016f\u017ee obsahovat p\u0159\u00edkaz, kter\u00fd se pokou\u0161\u00ed vr\u00e1tit mno\u017einu v\u00fdsledk\u016f.
22003=V\u00fdsledn\u00e1 hodnota je mimo rozsah pro datov\u00fd typ {0}.
XN015.S=Chyba s\u00ed\u0165ov\u00e9ho protokolu\: uveden\u00e1 velikost InputStream, parametr \#{0}, je men\u0161\u00ed ne\u017e skute\u010dn\u00e1 d\u00e9lka InputStream.
XJ011.S=Nelze p\u0159edat hodnotu ''null'' jm\u00e9nu bodu ulo\u017een\u00ed.
XJ082.U=Hodnoty BLOB/CLOB nejsou povoleny jako parametry metody nebo z\u00e1sobn\u00edky.
XJ069.S=V p\u0159\u00edpad\u011b p\u0159\u00edkazu proveden\u00ed USING nejsou povoleny \u017e\u00e1dn\u00e9 metody SetXXX.
XJ100.S=M\u011b\u0159\u00edtko dodan\u00e9 metodou registerOutParameter neodpov\u00edd\u00e1 metod\u011b setter. Mo\u017en\u00e1 ztr\u00e1ta p\u0159esnosti\!
XN013.S=Neplatn\u00e1 operace posuvu.
01J13=Vr\u00e1cen\u00fd po\u010det \u0159\u00e1dk\u016f ({0}) je p\u0159\u00edli\u0161 velk\u00fd, aby se ve\u0161el do celo\u010d\u00edseln\u00e9 prom\u011bnn\u00e9; vr\u00e1cen\u00e1 hodnota bude oseknuta.
XJ080.S=P\u0159\u00edkaz proveden\u00ed USING p\u0159edal {0} parametry sp\u00ed\u0161e ne\u017e {1}.
01J12=Nelze z\u00edskat text zpr\u00e1vy ze serveru. Prohl\u00e9dn\u011bte si dal\u0161\u00ed v\u00fdjimku. Ulo\u017een\u00e1 procedura SYSIBM.SQLCAMESSAGE nen\u00ed instalov\u00e1na na serveru. Obra\u0165te se na va\u0161eho administr\u00e1tora datab\u00e1ze, pros\u00edm.
XJ067.S=Ukazatel na text SQL m\u00e1 hodnotu ''null''.
01J10=Mno\u017einy v\u00fdsledk\u016f citliv\u00e9 na posuv nejsou podporov\u00e1ny serverem; p\u0159emapov\u00e1n\u00ed na kurzor, kter\u00fd se pohybuje pouze vp\u0159ed
XN011.S=D\u00e9lka jm\u00e9na procedury {0} nen\u00ed v platn\u00e9m rozsahu 1 a\u017e {1}.
58009.C.9=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: d\u00e9lka PKGNAMCSN, {0}, je neplan\u00e1 v SQLAM {1}. Spojen\u00ed bylo ukon\u010deno.
58009.C.8=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: d\u00e9lka SCLDTA, {0}, je neplan\u00e1 pro PKGID. Spojen\u00ed bylo ukon\u010deno.
XIE08.S=Neexistuje jmenovan\u00fd sloupec\: {0}. 
58009.C.7=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: d\u00e9lka SCLDTA, {0}, je neplan\u00e1 pro RDBCOLID. Spojen\u00ed bylo ukon\u010deno.
XJ065.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro Statement.setFetchSize(int rows).
XJ063.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro Statement.setMaxRows(int maxRows). Hodnota parametru mus\u00ed b\u00fdt >\= 0.
X0Y78.S.2=Bylo vol\u00e1no {0}.executeQuery(), ale nebyla vr\u00e1cena \u017e\u00e1dn\u00e1 mno\u017eina v\u00fdsledk\u016f. Pokud se nejedn\u00e1 o dotazy, pou\u017eijte p\u0159\u00edkaz {1}.executeUpdate().
X0Y78.S.1={0}.executeQuery() nelze volat, proto\u017ee bylo vr\u00e1ceno n\u011bkolik mno\u017ein v\u00fdsledk\u016f. Pou\u017eijte p\u0159\u00edkaz {1}.execute(), abyste z\u00edskali n\u011bkolik v\u00fdsledk\u016f.
XJ061.S=Metoda ''{0}'' je povolena pouze u posuvn\u00fdch kurzor\u016f.
01J08=Nelze otev\u0159\u00edt typ mno\u017einy v\u00fdsledk\u016f {0}. Byl otev\u0159en typ mno\u017einy v\u00fdsledk\u016f {1}.
01J07=ResultSetHoldability omezeno na ResultSet.CLOSE_CURSORS_AT_COMMIT pro glob\u00e1ln\u00ed transakci.
01J06=Mno\u017einu v\u00fdsledk\u016f nelze aktualizovat. Dotaz se nekvalifikuje pro generov\u00e1n\u00ed mno\u017einy v\u00fdsledk\u016f, kterou lze aktualizovat.
XCL16.S.1=Mno\u017eina v\u00fdsledk\u016f nen\u00ed otev\u0159ena. Ov\u011b\u0159te, \u017ee automatick\u00e9 potvrzov\u00e1n\u00ed je VYPNUTO.
J028=cesta k z\u00e1loze pro n\u00e1pravu rolov\u00e1n\u00edm vp\u0159ed
XJ044.S=''{0}'' je neplatn\u00fdm m\u011b\u0159\u00edtkem.
J025=cesta k adres\u00e1\u0159i protokolu
J023=heslo u\u017eivatele
08003.C.3=Z\u00e1kladn\u00ed fyzick\u00e9 p\u0159ipojen\u00ed je zastaral\u00e9 nebo zav\u0159en\u00e9.
J022=jm\u00e9no u\u017eivatele
08003.C.2=Metoda protokolu byla vol\u00e1na pro zav\u0159en\u00ed spojen\u00ed
J021=oblast pro datab\u00e1zi
08003.C.1=Metoda getConnection() nen\u00ed platn\u00e1 v zav\u0159en\u00e9m shrom\u00e1\u017ed\u011bn\u00e9m p\u0159ipojen\u00ed.
J020=tajn\u00fd \u0161ifrovac\u00ed kl\u00ed\u010d
XJ042.S=''{0}'' nen\u00ed platnou hodnotou pro vlastnost ''{1}''.
XJ209.S=Po\u017eadovan\u00e1 ulo\u017een\u00e1 procedura nen\u00ed instalov\u00e1na na serveru.
XJ118.S=Bylo po\u017eadov\u00e1no d\u00e1vkov\u00e9 zpracov\u00e1n\u00ed dotazu u p\u0159\u00edkazu, kter\u00fd nen\u00ed dotazem.
XJ207.S=Metodu executeQuery nelze pou\u017e\u00edt pro aktualizaci.
58017.C=Hodnota parametru DDM 0x{0} nen\u00ed podporov\u00e1na. Vstupn\u00ed prom\u011bnn\u00e1 hostitele nemus\u00ed b\u00fdt v rozsahu, kter\u00fd server podporuje. Spojen\u00ed bylo ukon\u010deno.
XJ098.S=Hodnota automaticky generovan\u00fdch kl\u00ed\u010d\u016f {0} je neplatn\u00e1
XJ116.S=Do jedin\u00e9 d\u00e1vky nelze p\u0159idat v\u00edce ne\u017e {0} p\u0159\u00edkaz\u016f.
XJ025.S=Vstupn\u00ed tok dat nem\u016f\u017ee m\u00edt z\u00e1pornou d\u00e9lku.
XJ096.S=Bal\u00edk prost\u0159edk\u016f nebyl nalezen v bal\u00edku {0} pro {1}
58015.C=Objekt DDM 0x{0} nen\u00ed podporov\u00e1n. Spojen\u00ed bylo ukon\u010deno.
XJ114.S=Neplatn\u00e9 jm\u00e9no kurzoru ''{0}''
XJ023.S=Vstupn\u00ed tok dat nem\u011bl p\u0159esn\u00e9 mno\u017estv\u00ed dat jako po\u017eadovan\u00e1 d\u00e9lka.
J019=vn\u011bj\u0161\u00ed \u0161ifrovac\u00ed kl\u00ed\u010d
XJ203.S=Jm\u00e9no kurzoru ''{0}'' je ji\u017e pou\u017e\u00edv\u00e1no
J018=d\u00e9lka \u0161ifrovac\u00edho kl\u00ed\u010de
XJ040.C=Selh\u00e1n\u00ed spu\u0161t\u011bn\u00ed datab\u00e1ze ''{0}''; podrobnosti viz dal\u0161\u00ed v\u00fdjimka.
J017=\u0161ifrovac\u00ed algoritmus
J016=poskytovatel \u0161ifrovac\u00ed slu\u017eby
XJ094.S=Tento objekt je ji\u017e zav\u0159en.
XJ112.S=Byla zji\u0161t\u011bna v\u00fdjimka zabezpe\u010den\u00ed; podrobnosti viz dal\u0161\u00ed v\u00fdjimka.
J013=p\u0159ej\u00edt na vy\u0161\u0161\u00ed verzi datab\u00e1ze
42622=Jm\u00e9no ''{0}'' je p\u0159\u00edli\u0161 dlouh\u00e9. Maxim\u00e1ln\u00ed d\u00e9lka je ''{1}''.
XJ021.S=Typ nen\u00ed podporov\u00e1n.
22007.S.181=Syntaxe zn\u00e1zorn\u011bn\u00ed \u0159et\u011bzce hodnoty data/\u010dasu je nespr\u00e1vn\u00e1.
XJ008.S=Nelze rolovat zp\u011bt nebo uvolnit bod ulo\u017een\u00ed, kdy\u017e jste v re\u017eimu automatick\u00e9ho potvrzov\u00e1n\u00ed.
J010=za\u0161ifrovat datab\u00e1zi na disku
XJ110.S=Jm\u00e9no prim\u00e1rn\u00ed tabulky nem\u016f\u017ee m\u00edt hodnotu ''null''
XJ079.S=Uveden\u00e1 d\u00e9lka ''{0}'' p\u0159ekra\u010duje velikost BLOB/CLOB.
2D521.S.2=Operace COMMIT nebo ROLOV\u00c1N\u00cd ZP\u011aT jsou neplatn\u00e9 pro prost\u0159ed\u00ed prov\u00e1d\u011bn\u00ed aplikace. 
2D521.S.1=setAutoCommit(true) je neplatn\u00e9 b\u011bhem glob\u00e1ln\u00ed transakce.
XJ090.S=Neplatn\u00fd parametr\: kalend\u00e1\u0159 m\u00e1 hodnotu ''null''.
XJ077.S=Do\u0161lo k v\u00fdjimce p\u0159i pokusu o na\u010dten\u00ed prvn\u00edho bajtu/znaku vzoru BLOB/CLOB pomoc\u00ed getBytes/getSubString.
58009.C.21=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: d\u00e9lka SCLDTA, {0}, je neplan\u00e1 pro RDBNAM. Spojen\u00ed bylo ukon\u010deno.
58009.C.20=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: pouze jedna z hodnot NVCM a NVCS m\u016f\u017ee b\u00fdt nenulov\u00e1. Spojen\u00ed bylo ukon\u010deno.
XJ05B.C=Atribut JDBC ''{0}'' m\u00e1 neplatnou hodnotu ''{1}''. Platn\u00e9 hodnoty jsou ''{2}''.
XN008.S=Zpracov\u00e1n\u00ed dotazu bylo ukon\u010deno kv\u016fli chyb\u011b na serveru.
XCL13.S=Pozice parametru ''{0}'' je mimo rozsah. Po\u010det parametr\u016f pro tento p\u0159ipraven\u00fd p\u0159\u00edkaz je ''{1}''.
08006.C.6=Pokus o \u00fapln\u00e9 uskute\u010dn\u011bn\u00ed dat protokolu, kter\u00e1 jsou p\u0159\u00edli\u0161 velk\u00e1 pro JVM. Spojen\u00ed bylo ukon\u010deno.
08006.C.5=Nedostatek dat p\u0159i na\u010d\u00edt\u00e1n\u00ed ze s\u00edt\u011b - o\u010dek\u00e1valo se minim\u00e1ln\u011b {0} bajt\u016f a bylo p\u0159ijato pouze {1} bajt\u016f. Spojen\u00ed bylo ukon\u010deno.
J008=\u017e\u00e1dn\u00e9 podrobnosti
XJ073.S=Data v t\u00e9to metod\u011b BLOB nebo CLOB ji\u017e nejsou k dispozici. Transakce metody BLOB/CLOB m\u016f\u017ee b\u00fdt potvrzena, nebo je jej\u00ed spojen\u00ed zav\u0159eno.
08006.C.4=Vyskytla se chyba b\u011bhem odlo\u017een\u00e9ho resetov\u00e1n\u00ed spojen\u00ed a spojen\u00ed bylo ukon\u010deno. Podrobnosti viz z\u0159et\u011bzen\u00e9 v\u00fdjimky.
J007=vytvo\u0159it datab\u00e1zi
08006.C.3=Byla detekov\u00e1na chyba komunikac\u00ed\: {0}.
08006.C.2=V\u00fdjimka soketu\: ''{0}''
J005=vypnout server Derby
08006.C.1=Vyskytla se chyba b\u011bhem resetov\u00e1n\u00ed p\u0159ipojen\u00ed a p\u0159ipojen\u00ed bylo ukon\u010deno. Podrobnosti viz z\u0159et\u011bzen\u00e9 v\u00fdjimky.
J004=toto\u017enost datab\u00e1ze
XJ004.C=Datab\u00e1ze ''{0}'' nebyla nalezena.
XJ071.S=Metod\u011b BLOB nebo CLOB byl p\u0159ed\u00e1n argument se z\u00e1pornou d\u00e9lkou ''{0}''.
22005.S.6=Nerozpoznan\u00fd typ SQL Javy {0}.
22005.S.5=Neplatn\u00fd typ JDBC pro parametr {0}.
XN002.U=SECTKN nebylo vr\u00e1ceno.
XJ058.S=Nelze rolovat zp\u011bt glob\u00e1ln\u00ed transakci pomoc\u00ed p\u0159ipojen\u00ed. Zpracov\u00e1n\u00ed potvrzen\u00ed mus\u00ed proj\u00edt rozhran\u00edm XAResource.
22005.S.4=Nerozpoznan\u00fd typ JDBC. Typ\: {0}, po\u010detSloupc\u016f\: {1}, indexSloupce\: {2}.
58009.C.19=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: nebylo vr\u00e1ceno SECTKN. Spojen\u00ed bylo ukon\u010deno.
22005.S.3=\u0158et\u011bzec Unicode nelze konvertovat na \u0159et\u011bzec EBCDIC
58009.C.18=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: neplatn\u00fd FDOCA LID. Spojen\u00ed bylo ukon\u010deno.
22005.S.2=Po\u017eadovan\u00fd konvertor znak\u016f nen\u00ed k dispozici.
58009.C.17=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: byl p\u0159ed\u010dasn\u011b dosa\u017een konec toku dat p\u0159i \u010dten\u00ed vstupn\u00edho toku, parametr \#{0}. Spojen\u00ed bylo ukon\u010deno.
22005.S.1=Nelze konvertovat hodnotu typu ''{0}'' na typ ''{1}'' \: zak\u00f3dov\u00e1n\u00ed nen\u00ed podporov\u00e1no.
58009.C.16=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: DSS je z\u0159et\u011bzeno se stejn\u00fdm ID na konci anal\u00fdzy \u0159et\u011bzu stejn\u00e9ho ID. Spojen\u00ed bylo ukon\u010deno.
58009.C.15=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: d\u00e9lka DSS nen\u00ed 0 na konci anal\u00fdzy \u0159et\u011bzu stejn\u00e9ho ID. Spojen\u00ed bylo ukon\u010deno.
58009.C.14=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: z\u00e1sobn\u00edk kolekce nen\u00ed pr\u00e1zdn\u00fd na konci anal\u00fdzy \u0159et\u011bzu stejn\u00e9ho ID. Spojen\u00ed bylo ukon\u010deno.
XJ056.S=Nelze zapnout automatick\u00e9 potvrzov\u00e1n\u00ed v p\u0159ipojen\u00ed XA.
58009.C.13=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: kolekce DDM obsahuje m\u00e9n\u011b ne\u017e 4 bajty dat. Spojen\u00ed bylo ukon\u010deno.
58009.C.12=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: aktu\u00e1ln\u00ed identifika\u010dn\u00ed bod {0} neodpov\u00edd\u00e1 o\u010dek\u00e1van\u00e9mu identifika\u010dn\u00edmu bodu {1}. Spojen\u00ed bylo ukon\u010deno.
58009.C.11=Spojen\u00ed bylo ukon\u010deno, proto\u017ee zak\u00f3dov\u00e1n\u00ed nen\u00ed podporov\u00e1no.
58009.C.10=V\u00fdjimka s\u00ed\u0165ov\u00e9ho protokolu\: pouze jedna z d\u00e9lek VCM a VCS m\u016f\u017ee b\u00fdt v\u011bt\u0161\u00ed ne\u017e 0. Spojen\u00ed bylo ukon\u010deno.
XJ050.U=Datab\u00e1ze po\u017eaduje upgrade z verze {0}. Nastavte atribut ''upgrade\=true'' adresy URL p\u0159ipojen\u00ed JDBC, abyste povolili upgrade na verzi {1}.
XJ128.S=Nelze rozbalit pro ''{0}''
XJ126.S=Tato metoda by nem\u011bla b\u00fdt vol\u00e1na na citliv\u00e9 dynamick\u00e9 kurzory.
XJ215.S=Po vyvol\u00e1n\u00ed metody free() nem\u016f\u017eete vyvolat jin\u00e9 metody java.sql.Clob/java.sql.Blob.
XJ124.S=Sloupec nelze aktualizovat.
XJ122.S=Nebyly vol\u00e1ny \u017e\u00e1dn\u00e9 metody updateXXX na tomto \u0159\u00e1dku.
24000=Neplatn\u00fd stav kurzoru - \u017e\u00e1dn\u00fd aktu\u00e1ln\u00ed \u0159\u00e1dek.
XJ018.S=Jm\u00e9no sloupce nem\u016f\u017ee m\u00edt hodnotu ''null''.
XJ211.S=Vyskytla se neopraviteln\u00e1 v\u00fdjimka b\u011bhem d\u00e1vkov\u00e9ho zpracov\u00e1n\u00ed, kter\u00e1 p\u0159eru\u0161uje \u0159et\u011bzec. D\u00e1vkov\u00e9 zpracov\u00e1n\u00ed je neatomicky ukon\u010deno.
XJ107.S=Chybn\u00e1 vata
XJ016.S=Metoda ''{0}'' nen\u00ed povolena v p\u0159ipraven\u00e9m p\u0159\u00edkazu.
XJ213.C=Vlastnost p\u0159ipojen\u00ed traceLevel nem\u00e1 platn\u00fd form\u00e1t \u010d\u00edsla.
XJ105.S=Kl\u00ed\u010d DES m\u00e1 chybnou d\u00e9lku. O\u010dek\u00e1van\u00e1 d\u00e9lka {0}, obdr\u017een\u00e1 d\u00e9lka {1}.
XN018.S=Chyba s\u00ed\u0165ov\u00e9ho protokolu\: uveden\u00e1 velikost Reader, parametr \#{0}, je men\u0161\u00ed ne\u017e skute\u010dn\u00e1 d\u00e9lka InputStream.
XJ014.S=\u017d\u00e1dn\u00e9 jm\u00e9no pro nejmenovan\u00e9 body ulo\u017een\u00ed.
XJ085.S=Tok dat ji\u017e byl p\u0159e\u010dten, byl dosa\u017een konec souboru a tok dat nelze pou\u017e\u00edt znovu.
XJ103.S=Jm\u00e9no tabulky nesm\u00ed m\u00edt hodnotu ''null''
22015.S.1=Neplatn\u00e1 konverze dat\: po\u017eadovan\u00e1 konverze by m\u011bla za n\u00e1sledek ztr\u00e1tu p\u0159esnosti {0}
XJ04C.S=D\u00e1vka CallableStatement nem\u016f\u017ee obsahovat v\u00fdstupn\u00ed parametry.
XN016.S=Chyba s\u00ed\u0165ov\u00e9ho protokolu\: byla zji\u0161t\u011bna chyba v ov\u011b\u0159en\u00ed d\u00e9lky toku dat, parametr \#{0}. Zpr\u00e1va\: {1}.
XJ012.S=''{0}'' je ji\u017e zav\u0159eno.
XJ083.U=''{0}'' nen\u00ed povoleno, proto\u017ee mno\u017eina v\u00fdsledk\u016f nen\u00ed mno\u017einou v\u00fdsledk\u016f, kterou lze aktualizovat. 
42X74=Neplatn\u00e1 syntaxe p\u0159\u00edkazu CALL.
XN014.S=Chyba s\u00ed\u0165ov\u00e9ho protokolu\: byla zji\u0161t\u011bna v\u00fdjimka I/O, parametr \#{0}. Zb\u00fdvaj\u00edc\u00ed data byla vypln\u011bna 0x0. Zpr\u00e1va\: {1}.
XJ010.S=Nelze zadat bod ulo\u017een\u00ed, kdy\u017e je zapnuto automatick\u00e9 potvrzov\u00e1n\u00ed.
XCL08.S=Kurzor ''{0}'' nen\u00ed na \u0159\u00e1dku.
XJ081.S=Byla p\u0159ed\u00e1na neplatn\u00e1 hodnota ''{0}'' jako parametr ''{1}'' metod\u011b ''{2}''
XJ068.S=Uprost\u0159ed d\u00e1vky je povoleno pouze executeBatch a clearBatch.
XN012.S=Na platform\u00e1ch {0} podporuje XA verzi {1} a vy\u0161\u0161\u00ed. Toto je verze {2}
XJ066.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro Statement.setMaxFieldSize(int max).
XN010.S=Jm\u00e9no procedury nesm\u00ed m\u00edt hodnotu ''null''.
J133=Heslo u\u017eivatele pro p\u0159ipojen\u00ed
J132=Jm\u00e9no u\u017eivatele pro p\u0159ipojen\u00ed
J130=Byla detekov\u00e1na chyba neplatn\u00e9ho popisu FDOCA PROTOKOLU
XJ064.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro setFetchDirection(int direction).
0A000.S.7=Datov\u00fd typ ''{0}'' nen\u00ed podporov\u00e1n.
XJ081.C=Byly uvedeny konfliktn\u00ed atributy vytvo\u0159en\u00ed/obnovy/n\u00e1pravy.
0A000.S.5=Mechanizmus zabezpe\u010den\u00ed ''{0}'' nen\u00ed podporov\u00e1n.
0A000.S.4=Metoda cancel() nen\u00ed podporov\u00e1na serverem.
08006.D=Vypnut\u00ed datab\u00e1ze ''{0}''.
0A000.S.3=Vlastnost resultSetHoldability {0} nen\u00ed podporov\u00e1na
08006.C=Byla zji\u0161t\u011bna chyba s\u00ed\u0165ov\u00e9ho protokolu a spojen\u00ed bylo ukon\u010deno\: {0}
0A000.S.2=Metoda JDBC {0} nen\u00ed podporov\u00e1na serverem. Povy\u0161te server, pros\u00edm.
24501.S=Ozna\u010den\u00fd kurzor nen\u00ed otev\u0159en.
0A000.S.1=Metoda JDBC zat\u00edm nen\u00ed implementov\u00e1na.
XJ062.S=Neplatn\u00e1 hodnota parametru ''{0}'' pro ResultSet.setFetchSize(int rows).
J129=byl vyd\u00e1n p\u0159\u00edkaz Open Query pro dotaz, kter\u00fd ji\u017e byl otev\u0159en
J128=kurzor nen\u00ed otev\u0159en
XJ045.S=Metod\u011b Connection.setTransactionIsolation() byla p\u0159ed\u00e1na neplatn\u00e1 nebo (moment\u00e1ln\u011b) nepodporovan\u00e1 \u00farove\u0148 izolace ''{0}''. Moment\u00e1ln\u011b podporovan\u00fdmi hodnotami jsou java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED a java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
J127=parseSQLDIAGGRP dosud nen\u00ed implementov\u00e1n
J126=Byla detekov\u00e1na chyba interak\u010dn\u00edho protokolu. P\u0159\u00ed\u010dina\: 0x{0}.
XJ049.C=Byly uvedeny konfliktn\u00ed atributy vytvo\u0159en\u00ed.
J125=Byla detekov\u00e1na neshoda popisova\u010de dat.
J124=p\u0159\u00edkaz pro p\u0159\u00edstup k rela\u010dn\u00ed datab\u00e1zi (ACCRDB) nelze zadat, proto\u017ee k datab\u00e1zi ji\u017e existuje p\u0159\u00edstup
J123=po\u017eadovan\u00fd p\u0159\u00edkaz narazil na architektonicky nevy\u0159e\u0161enou a implementa\u010dn\u011b z\u00e1vislou podm\u00ednku, pro kterou nebyla vytvo\u0159ena \u017e\u00e1dn\u00e1 zpr\u00e1va
J122=byl vyd\u00e1n p\u0159\u00edkaz po\u017eaduj\u00edc\u00ed slu\u017eby datab\u00e1ze p\u0159ed p\u0159\u00edkazem po\u017eaduj\u00edc\u00edm p\u0159\u00edstup k datab\u00e1zi (ACCRDB)
J121=u\u017eivatel nen\u00ed autorizov\u00e1n pro p\u0159\u00edstup k datab\u00e1zi
J120=neuvedeno
07000=Alespo\u0148 jeden parametr aktu\u00e1ln\u00edho p\u0159\u00edkazu nen\u00ed inicializov\u00e1n.
25001=Nelze zav\u0159\u00edt spojen\u00ed, kdy\u017e je transakce st\u00e1le aktivn\u00ed.
XJ208.S=Neatomick\u00e9 selh\u00e1n\u00ed d\u00e1vky. D\u00e1vka byla zad\u00e1na, ale vyskytla se alespo\u0148 jedna v\u00fdjimka u jednotliv\u00e9ho \u010dlenu d\u00e1vky. Pou\u017eijte p\u0159\u00edkaz getNextException(), abyste na\u010detli v\u00fdjimky pro ur\u010dit\u00e9 prvky d\u00e1vky.
XJ099.S=Objekt Reader/Stream neobsahuje znaky d\u00e9lky
XJ117.S=D\u00e1vkov\u00e9 zpracov\u00e1n\u00ed dotaz\u016f nen\u00ed povoleno slu\u010ditelnost\u00ed J2EE.
23502=Sloupec ''{0}'' nem\u016f\u017ee p\u0159ij\u00edmat hodnotu ''null''.
XJ206.S=Text SQL ''{0}'' nem\u00e1 \u017e\u00e1dn\u00e9 tokeny.
42ZA1=Neplatn\u00e9 SQL v d\u00e1vce\: ''{0}''.
58016.C=Parametr DDM 0x{0} nen\u00ed podporov\u00e1n. Spojen\u00ed bylo ukon\u010deno.
XJ097.S=Nelze rolovat zp\u011bt nebo uvolnit bod ulo\u017een\u00ed, kter\u00fd nebyl vytvo\u0159en t\u00edmto spojen\u00edm.
08001.C.9=Spojen\u00ed nebylo ustanoveno, proto\u017ee jm\u00e9no datab\u00e1ze ''{0}'' je del\u0161\u00ed ne\u017e maxim\u00e1ln\u00ed d\u00e9lka povolen\u00e1 s\u00ed\u0165ov\u00fdm protokolem.
XJ115.S=Nelze otev\u0159\u00edt mno\u017einu v\u00fdsledk\u016f s po\u017eadovanou zadr\u017eitelnost\u00ed {0}.
08001.C.8=Heslo nesm\u00ed m\u00edt hodnotu ''null''.
08001.C.7=ID u\u017eivatele nesm\u00ed m\u00edt hodnotu ''null''.
08001.C.6=D\u00e9lka hesla ({0}) je mimo rozsah 1 a\u017e {1}.
XJ041.C=Selh\u00e1n\u00ed vytvo\u0159en\u00ed datab\u00e1ze ''{0}''; podrobnosti viz dal\u0161\u00ed v\u00fdjimka.
3B502.S=Bylo uvedeno RELEASE nebo ROLLBACK TO SAVEPOINT, ale bod ulo\u017een\u00ed neexistuje.
08001.C.5=D\u00e9lka ID u\u017eivatele ({0}) je mimo rozsah 1 a\u017e {1}.
J118=heslo vypr\u0161elo
XJ204.S=Nelze otev\u0159\u00edt mno\u017einu v\u00fdsledk\u016f s po\u017eadovanou zadr\u017eitelnost\u00ed {0}.
08001.C.4=Nelze otev\u0159\u00edt tok dat v soketu\: ''{0}''.
XJ028.C=Adresa URL ''{0}'' nen\u00ed \u0159\u00e1dn\u011b formov\u00e1na.
J117=Chyb\u011bj\u00edc\u00ed SECTKN u ACCSEC, kdy\u017e je po\u017eadov\u00e1n, nebo je neplatn\u00fd
58014.C=P\u0159\u00edkaz DDM 0x{0} nen\u00ed podporov\u00e1n. Spojen\u00ed bylo ukon\u010deno.
08001.C.3=V\u00fdjimka soketu\: ''{0}''
XJ095.S=Selh\u00e1n\u00ed pokusu o proveden\u00ed p\u0159ednostn\u00ed akce.
J116=chyba lok\u00e1ln\u00ed slu\u017eby zabezpe\u010den\u00ed, kterou nelze znovu zkusit
X0X95.S=Operaci ''{0}'' nelze prov\u00e9st na objektu ''{1}'', proto\u017ee existuje otev\u0159en\u00e1 mno\u017eina v\u00fdsledk\u016f, kter\u00e1 je z\u00e1visl\u00e1 na tomto objektu.
XJ113.S=Nelze otev\u0159\u00edt soubor {0} \: {1}
08001.C.2={0} \: Chyba p\u0159i p\u0159ipojov\u00e1n\u00ed k serveru {1} na portu {2} se zpr\u00e1vou\: {3}.
J115=nov\u00e9 heslo je neplatn\u00e9
XJ05C.S=Nelze nastavit zadr\u017eitelnost ResultSet.HOLD_CURSORS_OVER_COMMIT pro glob\u00e1ln\u00ed transakci.
08001.C.1=Po\u017eadovan\u00e1 vlastnost zdroje dat Derby {0} nen\u00ed nastavena.
J114=ID u\u017eivatele bylo odvol\u00e1no
J113=neplatn\u00e9 ID u\u017eivatele nebo heslo
0A000.C.6=P\u0159\u00edkaz DRDA {0} moment\u00e1ln\u011b nen\u00ed implementov\u00e1n. Spojen\u00ed bylo ukon\u010deno.
XJ022.S=Nelze nastavit tok dat\: ''{0}''.
J112=chyb\u011bj\u00edc\u00ed ID u\u017eivatele
XJ202.S=Neplatn\u00e9 jm\u00e9no kurzoru ''{0}''.
XJ009.S=Je po\u017eadov\u00e1no pou\u017eit\u00ed CallableStatement pro vol\u00e1n\u00ed ulo\u017een\u00e9 procedury nebo pou\u017eit\u00ed v\u00fdstupn\u00edch parametr\u016f\: {0}
J111=chyb\u011bj\u00edc\u00ed heslo
J110=mechanizmus zabezpe\u010den\u00ed nen\u00ed podporov\u00e1n
XJ093.S=D\u00e9lka BLOB/CLOB {0} je p\u0159\u00edli\u0161 velk\u00e1. D\u00e9lka nem\u016f\u017ee p\u0159ekro\u010dit {1}.
